{
    "results": [
        {
            "style_code": "Style 1",
            "satirical_column": "In a stunning display of economic wizardry that would make Gandalf the Grey look like a bumbling apprentice, Peter Mandelson, the Dark Lord of New Labour, has emerged from the shadows to offer his two pence on university funding. And by two pence, I mean an extra £230 per student, per year. It's heartwarming to see that even in these trying times, there's always room to squeeze a few more drops of blood from the stone that is the British student body.\n\nMandelson, a man so slippery he could moonlight as a waterslide, argues that raising tuition fees is the only way to save our hallowed institutions of higher learning from financial ruin. It's a bold strategy, Cotton. Let's see if it pays off for 'em.\n\nBut wait, there's more! In a twist that would make even the most seasoned contortionist wince, Mandelson suggests that this fee hike would actually be \"fair.\" Yes, you heard that right. In the topsy-turvy world of Mandelsonian logic, making students pay more is the epitome of fairness. It's like Robin Hood in reverse - rob from the poor to give to the... slightly less poor?\n\nThe Labour peer, clearly auditioning for the role of Ebenezer Scrooge in the Conservative Party's upcoming Christmas pantomime, goes on to suggest that universities need to make \"more tough choices\" to improve efficiency. One can only imagine what these \"tough choices\" might entail. Perhaps we could replace lectures with TikTok videos? Or maybe we could outsource marking to an AI that's been trained on the collected works of Jordan Peterson?\n\nBut the pièce de résistance in this comedy of errors is Mandelson's proposal for a \"progressive\" loan repayment system. It's so progressive, it's practically sprinting towards a dystopian future where graduates spend their entire lives in indentured servitude to the Department for Education. \n\nIn this brave new world, repayments would start at a mere 2% of income, increasing by 2 percentage points for every £10,000 earned. It's like a fun game of financial Snakes and Ladders, where every career advancement comes with the exciting prize of more debt! Who needs avocado toast when you can have the thrill of watching your loan repayments increase faster than a politician's expenses claim?\n\nBut fear not, dear students! For every cloud has a silver lining, and in this case, it's the knowledge that your crippling debt is \"particularly beneficial for women.\" Yes, ladies, rejoice! Your comparatively low salaries in crucial public service roles like nursing mean you get to enjoy the benefits of this progressive system for even longer. It's feminism in action, folks!\n\nAs we stumble blindly into this brave new world of higher education funding, one can't help but wonder: is this what Mandelson meant when he said New Labour was \"intensely relaxed about people getting filthy rich\"? Because it seems the only ones getting filthy rich here are the loan companies, while students are left filthy poor.\n\nIn conclusion, as Mandelson prepares to potentially take the reins at Oxford University, we can all look forward to a future where education is a luxury good, student debt is a lifelong companion, and the phrase \"I have a degree\" is met with the response \"I'm so sorry to hear that.\" But hey, at least we'll all be in this together. Except, of course, for those who can afford to pay their fees upfront. Now, if you'll excuse me, I'm off to see if I can trade my kidneys for a masters degree.",
            "headline": "Lord of the Fees: Mandelson's Magical Money-Making Scheme for Universities",
            "explanation": "The analogies in this satirical column are effective as they use humor and hyperbole to critique the proposed university funding changes by Peter Mandelson. They draw vivid comparisons that highlight the absurdity of the situation and engage the reader's imagination, making the critique more impactful. The analogies also reflect a deeper commentary on societal issues such as student debt and economic inequality, infusing the piece with both entertainment and a serious undertone.",
            "analogy_1": "Mandelson, a man so slippery he could moonlight as a waterslide",
            "analogy_2": "It's like Robin Hood in reverse - rob from the poor to give to the... slightly less poor?",
            "analogy_3": "It's like a fun game of financial Snakes and Ladders, where every career advancement comes with the exciting prize of more debt!",
            "scored_analogies": [
                {
                    "id": 1,
                    "style_code": "Style 1",
                    "analogy": "Mandelson, a man so slippery he could moonlight as a waterslide",
                    "humor_score": 8,
                    "originality_score": 7,
                    "bite_score": 9,
                    "total_score": 24
                },
                {
                    "id": 2,
                    "style_code": "Style 1",
                    "analogy": "It's like Robin Hood in reverse - rob from the poor to give to the... slightly less poor?",
                    "humor_score": 7,
                    "originality_score": 8,
                    "bite_score": 7,
                    "total_score": 22
                },
                {
                    "id": 3,
                    "style_code": "Style 1",
                    "analogy": "It's like a fun game of financial Snakes and Ladders, where every career advancement comes with the exciting prize of more debt!",
                    "humor_score": 8,
                    "originality_score": 6,
                    "bite_score": 8,
                    "total_score": 22
                }
            ],
            "total_set_score": 68
        },
        {
            "style_code": "Style 2",
            "satirical_column": "In a dazzling display of political psychedelia, Peter Mandelson, the Cheshire Cat of New Labour, has once again materialized to offer his grinning wisdom on the state of university funding. Picture, if you will, a scene straight out of Lewis Carroll's wildest fever dreams: Mandelson, resplendent in a suit made entirely of student loan agreements, holding court in a chamber where the walls pulsate with the anxiety of indebted graduates.\n\n\"We must raise tuition fees!\" he proclaims, his words transforming into a shower of pound coins that rain down upon a group of students who've mysteriously shrunk to the size of field mice. \"It's for stability, you see,\" he adds, as the coins morph into a teetering Jenga tower of financial precarity.\n\nBut wait! In a twist that would make Salvador Dalí reach for his melting clock, Mandelson's proposal isn't just about hiking fees. Oh no, dear readers. It's a veritable smorgasbord of fiscal surrealism. Picture, if you dare, a progressive loan system where repayments start at 2% and increase by 2 percentage points for every £10,000 earned. It's like a game of Snake and Ladders, but the snakes are student debt and the ladders are... well, there are no ladders. Just more snakes.\n\nAnd let's not forget the pièce de résistance of this hallucinogenic policy trip: Mandelson's suggestion that Italian universities, with their 1:21 staff-to-student ratio, are a model of efficiency. One can only imagine the scenes of Dante-esque pandemonium as British lecturers attempt to simultaneously teach, mark, and research while juggling 21 students each. Perhaps they'll develop a hive mind, or better yet, clone themselves using the power of underfunded research labs.\n\nBut fear not, for in this brave new world of higher education, we have Jacqui Smith, the skills minister, offering cryptic assurances about student maintenance funding. \"We hear you,\" she whispers into the void, her words echoing through the empty wallets of students nationwide. One half expects her to pull a white rabbit out of a hat, only to discover it's actually the ghost of social mobility, long since departed from these hallowed halls.\n\nAnd just when you thought this psychedelic journey couldn't get any stranger, in swoops Tim Leunig, economist extraordinaire, with a proposal so outlandish it makes Mandelson look like a bastion of conservatism. Graduates paying a minimum of £10 a week? Employers charged a 1% graduate hiring surcharge? It's as if he's concocted a potion of pure economic absurdism and served it in a champagne flute made of shattered dreams.\n\nAs we stumble, bleary-eyed and disoriented, through this wonderland of policy proposals, one can't help but wonder: Has the looking glass always been this cracked? Or have we simply been staring at it for too long, hypnotized by the swirling patterns of political doublespeak and economic sleight of hand?\n\nIn the end, as the colors fade and the walls stop breathing, we're left with the unsettling realization that this isn't just a bad trip. It's the reality of higher education policy in England, where the Mad Hatter's tea party never ends, and everyone's invoice is always due. \n\nSo, dear students, hold onto your mortarboards and brace yourselves for a future where your degree might just cost you the keys to Wonderland itself. After all, in Mandelson's magic kingdom, even the Cheshire Cat's grin comes with a price tag.",
            "headline": "Mandelson's Psychedelic Tuition Trip: A Kaleidoscope of Fiscal Follies",
            "explanation": "The analogies in this satirical column effectively use vivid imagery and cultural references to depict the absurdities of higher education funding proposals. They create a surreal and entertaining mental landscape that captures the reader's attention, blending humor with commentary on the serious issue of tuition fees. The effectiveness lies in their ability to transform complex ideas into relatable scenarios, inviting readers to visualize and critique the policies in a whimsical yet critical manner.",
            "analogy_1": "Mandelson, resplendent in a suit made entirely of student loan agreements",
            "analogy_2": "It's like a game of Snake and Ladders, but the snakes are student debt and the ladders are... well, there are no ladders. Just more snakes.",
            "analogy_3": "one half expects her to pull a white rabbit out of a hat, only to discover it's actually the ghost of social mobility, long since departed from these hallowed halls.",
            "scored_analogies": [
                {
                    "id": 4,
                    "style_code": "Style 2",
                    "analogy": "Mandelson, resplendent in a suit made entirely of student loan agreements",
                    "humor_score": 6,
                    "originality_score": 7,
                    "bite_score": 6,
                    "total_score": 19
                },
                {
                    "id": 5,
                    "style_code": "Style 2",
                    "analogy": "It's like a game of Snake and Ladders, but the snakes are student debt and the ladders are... well, there are no ladders. Just more snakes.",
                    "humor_score": 7,
                    "originality_score": 6,
                    "bite_score": 7,
                    "total_score": 20
                },
                {
                    "id": 6,
                    "style_code": "Style 2",
                    "analogy": "one half expects her to pull a white rabbit out of a hat, only to discover it's actually the ghost of social mobility, long since departed from these hallowed halls.",
                    "humor_score": 9,
                    "originality_score": 9,
                    "bite_score": 8,
                    "total_score": 26
                }
            ],
            "total_set_score": 65
        },
        {
            "style_code": "Style 3",
            "satirical_column": "In a stunning display of economic acrobatics that would make even the most seasoned circus performer blush, our dear friend Peter Mandelson has once again graced us with his infinite wisdom on how to solve the pressing issues of our time. Picture, if you will, a world where the solution to every problem is to reach deeper into the pockets of those least able to pay. Welcome to Mandelson's Marvelous Money Pit™!\n\nAs I sit here, sipping my artisanal, small-batch, ethically sourced tea (because heaven forbid I contribute to the exploitation of developing nations while pondering the exploitation of our own youth), I can't help but marvel at the sheer audacity of suggesting that the best way to ease pressure on universities is to increase the pressure on students. It's like proposing to solve world hunger by asking the starving to fast more efficiently.\n\nBut wait! There's more! In a twist that would make M. Night Shyamalan green with envy, Mandelson suggests that this increase is actually a \"stabilizing move.\" One can only assume he's using the same definition of \"stabilizing\" as a loan shark who breaks your kneecaps to ensure you won't run away from your debts.\n\nLet us pause for a moment to appreciate the Kafkaesque beauty of a system where the solution to crippling student debt is to make it more crippling. It's rather like suggesting that the cure for a hangover is to start drinking again, but with slightly more expensive alcohol.\n\nOf course, Mandelson, in his infinite magnanimity, proposes a \"progressive system\" of loan repayments. Under this system, graduates would start repaying at 2% of their income, increasing by 2 percentage points for each additional £10,000 earned. How wonderfully considerate! It's the financial equivalent of slowly turning up the heat under a frog in a pot. By the time they realize they're being boiled alive, it's too late to jump out.\n\nBut fear not, dear reader! For in this brave new world of higher education funding, we have visionaries like Tim Leunig, who proposes that graduates pay a minimum of £10 a week. What a bargain! For the mere price of two grande lattes at your local Starbucks, you too can contribute to the noble cause of keeping university administrators in the lifestyle to which they've become accustomed.\n\nAs I ponder these proposals, I can't help but think of my Great Aunt Gertrude, who used to say, \"If you can't afford caviar, eat sawdust – it's good for the digestion.\" Mandelson and his ilk seem to have taken this advice to heart, substituting \"education\" for \"caviar\" and \"crippling debt\" for \"sawdust.\"\n\nIn conclusion, dear friends, let us raise a toast (with our overpriced, student-loan-funded beverages) to the future of higher education in England. May our universities continue to thrive on the backs of generations of indentured graduates, and may we never lose sight of the true purpose of education: to provide a steady stream of income for those who already have more than they could ever need.\n\nNow, if you'll excuse me, I need to go take out a second mortgage to fund my nephew's upcoming semester at the University of Fiscal Despair. After all, what's family for, if not to share in the joys of generational debt?",
            "headline": "Mandelson's Monetary Machinations: A Modest Proposal for Fleecing the Future",
            "explanation": "The analogies in this satirical column effectively illustrate the absurdity and irony of financial proposals regarding student debt and education funding. Each analogy serves to amplify the critique of the original proposals, showcasing the disconnect between the intentions of policymakers and the harsh realities faced by students. The effectiveness lies in their vivid imagery and relatable comparisons, making complex economic ideas more accessible and engaging for readers. The analogies also add a layer of humor and satire, which enhances the overall entertainment value of the column.",
            "analogy_1": "It's like proposing to solve world hunger by asking the starving to fast more efficiently.",
            "analogy_2": "One can only assume he's using the same definition of \"stabilizing\" as a loan shark who breaks your kneecaps to ensure you won't run away from your debts.",
            "analogy_3": "It's the financial equivalent of slowly turning up the heat under a frog in a pot.",
            "scored_analogies": [
                {
                    "id": 7,
                    "style_code": "Style 3",
                    "analogy": "It's like proposing to solve world hunger by asking the starving to fast more efficiently.",
                    "humor_score": 9,
                    "originality_score": 8,
                    "bite_score": 10,
                    "total_score": 27
                },
                {
                    "id": 8,
                    "style_code": "Style 3",
                    "analogy": "One can only assume he's using the same definition of 'stabilizing' as a loan shark who breaks your kneecaps to ensure you won't run away from your debts.",
                    "humor_score": 10,
                    "originality_score": 9,
                    "bite_score": 10,
                    "total_score": 29
                },
                {
                    "id": 9,
                    "style_code": "Style 3",
                    "analogy": "It's the financial equivalent of slowly turning up the heat under a frog in a pot.",
                    "humor_score": 8,
                    "originality_score": 8,
                    "bite_score": 9,
                    "total_score": 25
                }
            ],
            "total_set_score": 81,
            "labelled_analogies": [
                "It's like proposing to solve {{world hunger}} by asking the starving to fast more efficiently.",
                "One can only assume he's using the same definition of 'stabilizing' as a {{loan shark}} who breaks your kneecaps to ensure you won't run away from your debts.",
                "It's the financial equivalent of slowly turning up the heat under a {{frog}} in a pot."
            ],
            "processed_analogies": [
                "It's like proposing to solve {1} by asking the starving to fast more efficiently.",
                "One can only assume he's using the same definition of 'stabilizing' as a {2} who breaks your kneecaps to ensure you won't run away from your debts.",
                "It's the financial equivalent of slowly turning up the heat under a {3} in a pot."
            ],
            "giveaway_keywords": [
                {
                    "id": 1,
                    "answer": "world hunger"
                },
                {
                    "id": 2,
                    "answer": "loan shark"
                },
                {
                    "id": 3,
                    "answer": "frog"
                }
            ],
            "alternative_sets": [
                {
                    "analogy_index": 0,
                    "original_analogy": "It's like proposing to solve {1} by asking the starving to fast more efficiently.",
                    "alternative_sets": [
                        {
                            "analogy": "It's like proposing to solve global Wi-Fi outage by asking the starving to fast more efficiently.",
                            "alternative_words": {
                                "1": "global Wi-Fi outage"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 2,
                            "adjusted_score": 22
                        },
                        {
                            "analogy": "It's like proposing to solve celebrity gossip drought by asking the starving to fast more efficiently.",
                            "alternative_words": {
                                "1": "celebrity gossip drought"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 2,
                            "adjusted_score": 22
                        },
                        {
                            "analogy": "It's like proposing to solve universal pizza shortage by asking the starving to fast more efficiently.",
                            "alternative_words": {
                                "1": "universal pizza shortage"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 2,
                            "adjusted_score": 22
                        },
                        {
                            "analogy": "It's like proposing to solve worldwide Netflix crash by asking the starving to fast more efficiently.",
                            "alternative_words": {
                                "1": "worldwide Netflix crash"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 2,
                            "adjusted_score": 22
                        },
                        {
                            "analogy": "It's like proposing to solve global meme famine by asking the starving to fast more efficiently.",
                            "alternative_words": {
                                "1": "global meme famine"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 2,
                            "adjusted_score": 22
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "It's like proposing to solve global Wi-Fi outage by asking the starving to fast more efficiently.",
                                "alternative_words": {
                                    "1": "global Wi-Fi outage"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 9
                                },
                                "total_score": 24,
                                "similarity_score": 2,
                                "adjusted_score": 22
                            },
                            {
                                "analogy": "It's like proposing to solve celebrity gossip drought by asking the starving to fast more efficiently.",
                                "alternative_words": {
                                    "1": "celebrity gossip drought"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 9
                                },
                                "total_score": 24,
                                "similarity_score": 2,
                                "adjusted_score": 22
                            }
                        ]
                    }
                },
                {
                    "analogy_index": 1,
                    "original_analogy": "One can only assume he's using the same definition of 'stabilizing' as a {2} who breaks your kneecaps to ensure you won't run away from your debts.",
                    "alternative_sets": [
                        {
                            "analogy": "One can only assume he's using the same definition of 'stabilizing' as a credit card ninja who breaks your kneecaps to ensure you won't run away from your debts.",
                            "alternative_words": {
                                "2": "credit card ninja"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 3,
                            "adjusted_score": 21
                        },
                        {
                            "analogy": "One can only assume he's using the same definition of 'stabilizing' as a mortgage wizard who breaks your kneecaps to ensure you won't run away from your debts.",
                            "alternative_words": {
                                "2": "mortgage wizard"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 3,
                            "adjusted_score": 21
                        },
                        {
                            "analogy": "One can only assume he's using the same definition of 'stabilizing' as a debt ninja turtle who breaks your kneecaps to ensure you won't run away from your debts.",
                            "alternative_words": {
                                "2": "debt ninja turtle"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 8,
                                "bite_score": 7
                            },
                            "total_score": 24,
                            "similarity_score": 3,
                            "adjusted_score": 21
                        },
                        {
                            "analogy": "One can only assume he's using the same definition of 'stabilizing' as a interest rate pirate who breaks your kneecaps to ensure you won't run away from your debts.",
                            "alternative_words": {
                                "2": "interest rate pirate"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 3,
                            "adjusted_score": 21
                        },
                        {
                            "analogy": "One can only assume he's using the same definition of 'stabilizing' as a cashflow vampire who breaks your kneecaps to ensure you won't run away from your debts.",
                            "alternative_words": {
                                "2": "cashflow vampire"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 3,
                            "adjusted_score": 21
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "One can only assume he's using the same definition of 'stabilizing' as a credit card ninja who breaks your kneecaps to ensure you won't run away from your debts.",
                                "alternative_words": {
                                    "2": "credit card ninja"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 9
                                },
                                "total_score": 24,
                                "similarity_score": 3,
                                "adjusted_score": 21
                            },
                            {
                                "analogy": "One can only assume he's using the same definition of 'stabilizing' as a mortgage wizard who breaks your kneecaps to ensure you won't run away from your debts.",
                                "alternative_words": {
                                    "2": "mortgage wizard"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 9
                                },
                                "total_score": 24,
                                "similarity_score": 3,
                                "adjusted_score": 21
                            }
                        ]
                    }
                },
                {
                    "analogy_index": 2,
                    "original_analogy": "It's the financial equivalent of slowly turning up the heat under a {3} in a pot.",
                    "alternative_sets": [
                        {
                            "analogy": "It's the financial equivalent of slowly turning up the heat under a space hamster in a pot.",
                            "alternative_words": {
                                "3": "space hamster"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 7,
                                "bite_score": 8
                            },
                            "total_score": 24,
                            "similarity_score": 3,
                            "adjusted_score": 21
                        },
                        {
                            "analogy": "It's the financial equivalent of slowly turning up the heat under a singing cactus in a pot.",
                            "alternative_words": {
                                "3": "singing cactus"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 7,
                                "bite_score": 8
                            },
                            "total_score": 24,
                            "similarity_score": 3,
                            "adjusted_score": 21
                        },
                        {
                            "analogy": "It's the financial equivalent of slowly turning up the heat under a rubber duck in a pot.",
                            "alternative_words": {
                                "3": "rubber duck"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 3,
                            "adjusted_score": 18
                        },
                        {
                            "analogy": "It's the financial equivalent of slowly turning up the heat under a garden gnome in a pot.",
                            "alternative_words": {
                                "3": "garden gnome"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 3,
                            "adjusted_score": 18
                        },
                        {
                            "analogy": "It's the financial equivalent of slowly turning up the heat under a chocolate bunny in a pot.",
                            "alternative_words": {
                                "3": "chocolate bunny"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 3,
                            "adjusted_score": 18
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "It's the financial equivalent of slowly turning up the heat under a space hamster in a pot.",
                                "alternative_words": {
                                    "3": "space hamster"
                                },
                                "scores": {
                                    "originality_score": 9,
                                    "humor_score": 7,
                                    "bite_score": 8
                                },
                                "total_score": 24,
                                "similarity_score": 3,
                                "adjusted_score": 21
                            },
                            {
                                "analogy": "It's the financial equivalent of slowly turning up the heat under a singing cactus in a pot.",
                                "alternative_words": {
                                    "3": "singing cactus"
                                },
                                "scores": {
                                    "originality_score": 9,
                                    "humor_score": 7,
                                    "bite_score": 8
                                },
                                "total_score": 24,
                                "similarity_score": 3,
                                "adjusted_score": 21
                            }
                        ]
                    }
                }
            ],
            "final_alternative_keywords": [
                [
                    "celebrity gossip drought",
                    "global Wi-Fi outage"
                ],
                [
                    "credit card ninja",
                    "mortgage wizard"
                ],
                [
                    "space hamster",
                    "singing cactus"
                ]
            ],
            "six_word_story": "Mandelson proposes tuition fee increases for universities."
        }
    ]
}