{
    "results": [
        {
            "style_code": "Style 1",
            "satirical_column": "In a world where the line between performance art and criminal mischief grows ever thinner, we find ourselves pondering the profound question: is soup the new paint? Last week, three budding Pollocks decided to turn the National Gallery into their personal kitchen, treating Van Gogh's \"Sunflowers\" to a hearty helping of orange soup. Because nothing says \"I care about important issues\" quite like assaulting a dead man's magnum opus with Campbell's finest.\n\nThe culprits - a sexagenarian, a septuagenarian, and a twenty-something - form a veritable Neapolitan ice cream of activists. One can only imagine the planning session: \"Right, we've got 'grumpy old man', 'cantankerous granny', and 'disillusioned youth'. Now, all we need is some soup and a target that screams 'I'm both priceless and completely unrelated to our cause'.\"\n\nVan Gogh, that notoriously environmentally unfriendly Dutch painter, must be spinning in his grave. Or perhaps he's relieved - after all, having soup thrown at your work is still preferable to having your ear cut off. It's a shame he's not around to see it; he could have started a new series: \"Sunflowers in Minestrone\" or \"Starry Night with a Chance of Meatballs\".\n\nThe National Gallery, ever the optimist, assured us that the paintings were unharmed. Because if there's one thing we've learned from centuries of art history, it's that oil and soup don't mix. Unlike oil and literally anything else humans have ever fought over.\n\nBut let's not be too harsh on our soup-wielding trio. In a world where genuine protest often falls on deaf ears, perhaps we should applaud their creativity. After all, they've managed to do what countless art critics and historians have failed to do: make people actually look at a Van Gogh for more than 3 seconds.\n\nAnd isn't that the real purpose of art? To provoke thought, spark conversation, and occasionally, smell like Heinz. Van Gogh once said, \"I dream of painting and then I paint my dream.\" Little did he know that in 2023, someone would dream of soup and then soup his painting.\n\nAs for the protesters, they face charges of criminal damage. Their defense, one assumes, will be that they were simply trying to feed the starving artists of the world. Starting, rather ambitiously, with ones who've been dead for over a century.\n\nIn the end, perhaps this is all a grand metaphor for our times. Much like Van Gogh's sunflowers, our society stands tall and vibrant, only to have a steaming load of something orange and messy thrown all over it. The only difference is, we can't frame our mess and sell it for millions.\n\nSo, the next time you're in an art gallery, remember: that soup you see might not be a Warhol. It might just be lunch.",
            "headline": "Soup du Jour: When Protest Art Meets Actual Art",
            "explanation": "The analogies in the column effectively highlight the absurdity of using soup as a medium for protest art, drawing parallels between the act of throwing soup at famous paintings and traditional artistic practices. They emphasize the contrast between high art and lowbrow actions, poking fun at the lengths to which activists go to draw attention to their causes. These comparisons enhance the satirical tone, making the reader question the legitimacy and impact of such protests.",
            "analogy_1": "is soup the new paint?",
            "analogy_2": "a veritable Neapolitan ice cream of activists",
            "analogy_3": "a steaming load of something orange and messy thrown all over it.",
            "scored_analogies": [
                {
                    "id": 1,
                    "style_code": "Style 1",
                    "analogy": "is soup the new paint?",
                    "humor_score": 6,
                    "originality_score": 5,
                    "bite_score": 7,
                    "total_score": 18
                },
                {
                    "id": 2,
                    "style_code": "Style 1",
                    "analogy": "a veritable Neapolitan ice cream of activists",
                    "humor_score": 7,
                    "originality_score": 8,
                    "bite_score": 6,
                    "total_score": 21
                },
                {
                    "id": 3,
                    "style_code": "Style 1",
                    "analogy": "a steaming load of something orange and messy thrown all over it.",
                    "humor_score": 9,
                    "originality_score": 6,
                    "bite_score": 8,
                    "total_score": 23
                }
            ],
            "total_set_score": 62
        },
        {
            "style_code": "Style 2",
            "satirical_column": "In a twist that would make even the most avant-garde chef blush, Vincent van Gogh's iconic Sunflowers have been treated to an impromptu soup bath at London's National Gallery. It seems the protesters, in their infinite wisdom, have decided that the best way to save the planet is by dousing priceless artworks with what one can only hope was a vegan, locally-sourced, carbon-neutral broth.\n\nAs I sit here, sipping my own bowl of soup (carefully aimed away from any nearby Monets), I can't help but marvel at the sheer audacity of this culinary critique. It's as if someone took the concept of 'food for thought' and decided to make it literal, with a dash of anarchist seasoning.\n\nOne must wonder: what would dear Vincent make of this soupy situation? Perhaps he'd see it as a bold new technique, a way to add that extra zing to his already vibrant palette. \"Ah, yes,\" he might exclaim, \"the subtle notes of tomato really bring out the ochres!\"\n\nBut let's not forget the true heroes of this tale - the valiant gallery staff who must now add 'soup sommelier' to their already extensive list of qualifications. I can just imagine the job listings: \"Wanted: Art historian with a keen eye for Impressionism and the ability to differentiate between Minestrone and Mulligatawny at twenty paces.\"\n\nIn the grand tradition of protest art, our soup-wielding activists have certainly made a splash. Though one can't help but think they've rather missed the mark. After all, if you're going to throw soup at a painting, surely \"Campbell's Soup Cans\" by Warhol would have been a more apropos target? At least then we could appreciate the meta-irony of soup eating soup.\n\nAs for the arrested trio - Stephen Simpson, Mary Somerville, and Phillipa Green - one wonders if they realized they were inadvertently creating their own triptych of troublemakers. Move over, Van Gogh's maternal figure and sunflowers; make way for Bradford's finest and Cornwall's soupiest!\n\nIn the end, we're left with more questions than answers. Is this the dawn of a new art movement? Souprealism, perhaps? Will galleries now need to install splash guards and ladles alongside their security systems? And most pressingly, did anyone think to bring some crusty bread to mop up the mess?\n\nAs we navigate this brave new world of protest-cum-performance art, one thing is certain: Van Gogh's Sunflowers have never looked quite so... appetizing. Just remember, dear readers, the next time you visit a gallery, leave your soup at home. Unless, of course, you're planning on starting a revolution - in which case, may I suggest a nice gazpacho? It's much more refreshing, and far less likely to land you in hot water with the authorities.\n\nAnd so, as the art world collectively reaches for its napkins and scratches its head, we bid adieu to another day in the increasingly surreal landscape of modern activism. One can only hope that the next protest will at least have the decency to pair the art with a suitable wine. A nice Chianti, perhaps?",
            "headline": "Van Gogh's Sunflowers Marinate in Protest Soup: A Zesty Critique of Modern Activism",
            "explanation": "The analogies in this satirical column effectively juxtapose the absurdity of modern protest methods with culinary elements, enhancing the humor and critique of activism. The use of food-related analogies adds a layer of vivid imagery, making the critique more engaging and relatable. The analogies also spark curiosity and reflection on the intersection of art and protest, inviting readers to consider the implications of such actions in a light-hearted manner.",
            "analogy_1": "It's as if someone took the concept of 'food for thought' and decided to make it literal, with a dash of anarchist seasoning.",
            "analogy_2": "Perhaps he'd see it as a bold new technique, a way to add that extra zing to his already vibrant palette.",
            "analogy_3": "Move over, Van Gogh's maternal figure and sunflowers; make way for Bradford's finest and Cornwall's soupiest!",
            "scored_analogies": [
                {
                    "id": 4,
                    "style_code": "Style 2",
                    "analogy": "It's as if someone took the concept of 'food for thought' and decided to make it literal, with a dash of anarchist seasoning.",
                    "humor_score": 8,
                    "originality_score": 9,
                    "bite_score": 8,
                    "total_score": 25
                },
                {
                    "id": 5,
                    "style_code": "Style 2",
                    "analogy": "Perhaps he'd see it as a bold new technique, a way to add that extra zing to his already vibrant palette.",
                    "humor_score": 7,
                    "originality_score": 7,
                    "bite_score": 5,
                    "total_score": 19
                },
                {
                    "id": 6,
                    "style_code": "Style 2",
                    "analogy": "Move over, Van Gogh's maternal figure and sunflowers; make way for Bradford's finest and Cornwall's soupiest!",
                    "humor_score": 8,
                    "originality_score": 8,
                    "bite_score": 7,
                    "total_score": 23
                }
            ],
            "total_set_score": 67
        },
        {
            "style_code": "Style 3",
            "satirical_column": "In a world where art galleries have become the new soup kitchens, three brave culinary critics have taken it upon themselves to spice up Vincent van Gogh's \"Sunflowers\" with a dash of orange-hued broth. Move over, Campbell's – there's a new soup can in town, and it's making quite the splash.\n\nAs I strolled through the National Gallery's \"Poets and Lovers\" exhibition, I couldn't help but feel a tinge of disappointment. Where was the drama? The passion? The visceral connection between art and viewer that van Gogh himself so desperately sought? Enter our intrepid trio of soup-slingers: Stephen Simpson, Mary Somerville, and Phillipa Green – the Gordon Ramsays of the art world.\n\nWith the precision of a Jackson Pollock and the audacity of a Marcel Duchamp, they unleashed their culinary critique upon those unsuspecting sunflowers. One can only imagine van Gogh's ghostly voice echoing through the halls: \"Sacrebleu! At last, someone truly sees my work!\"\n\nBut let's not get ahead of ourselves. This isn't just about soup; it's about the eternal struggle between the bourgeoisie and the bouillon-geoisie. As Karl Marx once famously didn't say, \"The history of all hitherto existing society is the history of soup struggles.\"\n\nOur brave soup-throwers, hailing from the culinary capitals of Bradford and Penryn, have single-handedly revolutionized the concept of interactive art. No longer must we stand idly by, gazing at static canvases. Now, we can participate in the artistic process by hurling our lunch at priceless masterpieces. It's democracy in action, people!\n\nThe National Gallery, ever the killjoy, has removed the newly-souped sunflowers from public view. \"For examination,\" they claim. But we know better. They're probably in the back, adding croutons and a sprinkle of chives to complete the dish.\n\nAs for the charges of criminal damage? Pah! I say we throw the book at them – preferably a cookbook. These brave souls should be celebrated, not castigated. After all, they've done what countless art critics have failed to do for centuries: they've made people actually care about art for more than five minutes.\n\nIn the spirit of this new movement, I propose we rename the National Gallery the \"National Galleryouille.\" Let's replace those stuffy audio guides with ladles and turn every exhibition into a potluck. Monet's \"Water Lilies\"? More like \"Water Chilis.\" Picasso's \"Guernica\"? How about \"Goulash-nica\"?\n\nAs I leave the gallery, ducking to avoid the inevitable imitators armed with cans of minestrone and cartons of vichyssoise, I can't help but feel we're witnessing the dawn of a new era in art appreciation. Van Gogh may have cut off his ear, but our soup-throwing heroes have cut through the pretension of the art world with nothing more than a can opener and a dream.\n\nSo, the next time you find yourself standing before a masterpiece, don't just stand there – accessorize it with a little bouillabaisse. After all, art is meant to be consumed, right?",
            "headline": "Soup du Jour: A Masterpiece in Culinary Vandalism",
            "explanation": "The column effectively employs humor and satire through its use of analogies that liken the act of critiquing art to culinary experiences. This creates a vivid and entertaining juxtaposition that captures the reader's imagination. The comparisons highlight the absurdity of the critics' actions while simultaneously commenting on the relationship between art and audience engagement. Each analogy adds a layer of wit and encourages the reader to reflect on the nature of artistic appreciation.",
            "analogy_1": "In a world where art galleries have become the new soup kitchens, three brave culinary critics have taken it upon themselves to spice up Vincent van Gogh's 'Sunflowers' with a dash of orange-hued broth.",
            "analogy_2": "This isn't just about soup; it's about the eternal struggle between the bourgeoisie and the bouillon-geoisie.",
            "analogy_3": "As Karl Marx once famously didn't say, 'The history of all hitherto existing society is the history of soup struggles.'",
            "scored_analogies": [
                {
                    "id": 7,
                    "style_code": "Style 3",
                    "analogy": "In a world where art galleries have become the new soup kitchens, three brave culinary critics have taken it upon themselves to spice up Vincent van Gogh's 'Sunflowers' with a dash of orange-hued broth.",
                    "humor_score": 9,
                    "originality_score": 9,
                    "bite_score": 9,
                    "total_score": 27
                },
                {
                    "id": 8,
                    "style_code": "Style 3",
                    "analogy": "This isn't just about soup; it's about the eternal struggle between the bourgeoisie and the bouillon-geoisie.",
                    "humor_score": 10,
                    "originality_score": 10,
                    "bite_score": 10,
                    "total_score": 30
                },
                {
                    "id": 9,
                    "style_code": "Style 3",
                    "analogy": "As Karl Marx once famously didn't say, 'The history of all hitherto existing society is the history of soup struggles.'",
                    "humor_score": 9,
                    "originality_score": 9,
                    "bite_score": 9,
                    "total_score": 27
                }
            ],
            "total_set_score": 84,
            "labelled_analogies": [
                "In a world where art galleries have become the new soup kitchens, three brave culinary critics have taken it upon themselves to spice up {{Vincent van Gogh}}'s '{{Sunflowers}}' with a dash of {{orange-hued}} broth.",
                "This isn't just about {{soup}}; it's about the eternal struggle between the bourgeoisie and the bouillon-geoisie.",
                "As {{Karl Marx}} once famously didn't say, 'The history of all hitherto existing society is the history of {{soup}} struggles.'"
            ],
            "processed_analogies": [
                "In a world where art galleries have become the new soup kitchens, three brave culinary critics have taken it upon themselves to spice up {1}'s '{2}' with a dash of {3} broth.",
                "This isn't just about {4}; it's about the eternal struggle between the bourgeoisie and the bouillon-geoisie.",
                "As {5} once famously didn't say, 'The history of all hitherto existing society is the history of {6} struggles.'"
            ],
            "giveaway_keywords": [
                {
                    "id": 1,
                    "answer": "Vincent van Gogh"
                },
                {
                    "id": 2,
                    "answer": "Sunflowers"
                },
                {
                    "id": 3,
                    "answer": "orange-hued"
                },
                {
                    "id": 4,
                    "answer": "soup"
                },
                {
                    "id": 5,
                    "answer": "Karl Marx"
                },
                {
                    "id": 6,
                    "answer": "soup"
                }
            ],
            "alternative_sets": [
                {
                    "analogy_index": 0,
                    "original_analogy": "In a world where art galleries have become the new soup kitchens, three brave culinary critics have taken it upon themselves to spice up {1}'s '{2}' with a dash of {3} broth.",
                    "alternative_sets": [
                        {
                            "analogy": "In a world where art galleries have become the new soup kitchens, three brave culinary critics have taken it upon themselves to spice up Elvis Presley's 'Fireworks' with a dash of neon-green broth.",
                            "alternative_words": {
                                "2": "Fireworks",
                                "1": "Elvis Presley",
                                "3": "neon-green"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 7,
                                "bite_score": 8
                            },
                            "total_score": 24,
                            "similarity_score": 1,
                            "adjusted_score": 23
                        },
                        {
                            "analogy": "In a world where art galleries have become the new soup kitchens, three brave culinary critics have taken it upon themselves to spice up Darth Vader's 'Rubber Duckies' with a dash of glitter-covered broth.",
                            "alternative_words": {
                                "2": "Rubber Duckies",
                                "1": "Darth Vader",
                                "3": "glitter-covered"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 8,
                                "bite_score": 7
                            },
                            "total_score": 24,
                            "similarity_score": 1,
                            "adjusted_score": 23
                        },
                        {
                            "analogy": "In a world where art galleries have become the new soup kitchens, three brave culinary critics have taken it upon themselves to spice up Sherlock Holmes's 'Pineapples' with a dash of polka-dotted broth.",
                            "alternative_words": {
                                "2": "Pineapples",
                                "1": "Sherlock Holmes",
                                "3": "polka-dotted"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "In a world where art galleries have become the new soup kitchens, three brave culinary critics have taken it upon themselves to spice up SpongeBob SquarePants's 'Disco Balls' with a dash of rainbow-striped broth.",
                            "alternative_words": {
                                "2": "Disco Balls",
                                "1": "SpongeBob SquarePants",
                                "3": "rainbow-striped"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "In a world where art galleries have become the new soup kitchens, three brave culinary critics have taken it upon themselves to spice up The Cookie Monster's 'Chocolate Bunnies' with a dash of tie-dyed broth.",
                            "alternative_words": {
                                "2": "Chocolate Bunnies",
                                "1": "The Cookie Monster",
                                "3": "tie-dyed"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "In a world where art galleries have become the new soup kitchens, three brave culinary critics have taken it upon themselves to spice up Elvis Presley's 'Fireworks' with a dash of neon-green broth.",
                                "alternative_words": {
                                    "2": "Fireworks",
                                    "1": "Elvis Presley",
                                    "3": "neon-green"
                                },
                                "scores": {
                                    "originality_score": 9,
                                    "humor_score": 7,
                                    "bite_score": 8
                                },
                                "total_score": 24,
                                "similarity_score": 1,
                                "adjusted_score": 23
                            },
                            {
                                "analogy": "In a world where art galleries have become the new soup kitchens, three brave culinary critics have taken it upon themselves to spice up Darth Vader's 'Rubber Duckies' with a dash of glitter-covered broth.",
                                "alternative_words": {
                                    "2": "Rubber Duckies",
                                    "1": "Darth Vader",
                                    "3": "glitter-covered"
                                },
                                "scores": {
                                    "originality_score": 9,
                                    "humor_score": 8,
                                    "bite_score": 7
                                },
                                "total_score": 24,
                                "similarity_score": 1,
                                "adjusted_score": 23
                            }
                        ]
                    }
                },
                {
                    "analogy_index": 1,
                    "original_analogy": "This isn't just about {4}; it's about the eternal struggle between the bourgeoisie and the bouillon-geoisie.",
                    "alternative_sets": [
                        {
                            "analogy": "This isn't just about lava lamp; it's about the eternal struggle between the bourgeoisie and the bouillon-geoisie.",
                            "alternative_words": {
                                "4": "lava lamp"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 8,
                                "bite_score": 7
                            },
                            "total_score": 24,
                            "similarity_score": 1,
                            "adjusted_score": 23
                        },
                        {
                            "analogy": "This isn't just about marshmallow fluff; it's about the eternal struggle between the bourgeoisie and the bouillon-geoisie.",
                            "alternative_words": {
                                "4": "marshmallow fluff"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 8,
                                "bite_score": 7
                            },
                            "total_score": 24,
                            "similarity_score": 1,
                            "adjusted_score": 23
                        },
                        {
                            "analogy": "This isn't just about cotton candy; it's about the eternal struggle between the bourgeoisie and the bouillon-geoisie.",
                            "alternative_words": {
                                "4": "cotton candy"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 8,
                                "bite_score": 7
                            },
                            "total_score": 24,
                            "similarity_score": 1,
                            "adjusted_score": 23
                        },
                        {
                            "analogy": "This isn't just about smoothie; it's about the eternal struggle between the bourgeoisie and the bouillon-geoisie.",
                            "alternative_words": {
                                "4": "smoothie"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "This isn't just about jelly bean; it's about the eternal struggle between the bourgeoisie and the bouillon-geoisie.",
                            "alternative_words": {
                                "4": "jelly bean"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "This isn't just about lava lamp; it's about the eternal struggle between the bourgeoisie and the bouillon-geoisie.",
                                "alternative_words": {
                                    "4": "lava lamp"
                                },
                                "scores": {
                                    "originality_score": 9,
                                    "humor_score": 8,
                                    "bite_score": 7
                                },
                                "total_score": 24,
                                "similarity_score": 1,
                                "adjusted_score": 23
                            },
                            {
                                "analogy": "This isn't just about marshmallow fluff; it's about the eternal struggle between the bourgeoisie and the bouillon-geoisie.",
                                "alternative_words": {
                                    "4": "marshmallow fluff"
                                },
                                "scores": {
                                    "originality_score": 9,
                                    "humor_score": 8,
                                    "bite_score": 7
                                },
                                "total_score": 24,
                                "similarity_score": 1,
                                "adjusted_score": 23
                            }
                        ]
                    }
                },
                {
                    "analogy_index": 2,
                    "original_analogy": "As {5} once famously didn't say, 'The history of all hitherto existing society is the history of {6} struggles.'",
                    "alternative_sets": [
                        {
                            "analogy": "As Yoda once famously didn't say, 'The history of all hitherto existing society is the history of smoothie struggles.'",
                            "alternative_words": {
                                "5": "Yoda",
                                "6": "smoothie"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "As Willy Wonka once famously didn't say, 'The history of all hitherto existing society is the history of lava lamp struggles.'",
                            "alternative_words": {
                                "5": "Willy Wonka",
                                "6": "lava lamp"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "As Homer Simpson once famously didn't say, 'The history of all hitherto existing society is the history of jelly bean struggles.'",
                            "alternative_words": {
                                "5": "Homer Simpson",
                                "6": "jelly bean"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "As Kermit the Frog once famously didn't say, 'The history of all hitherto existing society is the history of marshmallow fluff struggles.'",
                            "alternative_words": {
                                "5": "Kermit the Frog",
                                "6": "marshmallow fluff"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "As The Grinch once famously didn't say, 'The history of all hitherto existing society is the history of cotton candy struggles.'",
                            "alternative_words": {
                                "5": "The Grinch",
                                "6": "cotton candy"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "As Yoda once famously didn't say, 'The history of all hitherto existing society is the history of smoothie struggles.'",
                                "alternative_words": {
                                    "5": "Yoda",
                                    "6": "smoothie"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 6
                                },
                                "total_score": 21,
                                "similarity_score": 1,
                                "adjusted_score": 20
                            },
                            {
                                "analogy": "As Willy Wonka once famously didn't say, 'The history of all hitherto existing society is the history of lava lamp struggles.'",
                                "alternative_words": {
                                    "5": "Willy Wonka",
                                    "6": "lava lamp"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 6
                                },
                                "total_score": 21,
                                "similarity_score": 1,
                                "adjusted_score": 20
                            }
                        ]
                    }
                }
            ],
            "final_alternative_keywords": [
                [
                    "Rubber Duckies",
                    "Fireworks"
                ],
                [
                    "Elvis Presley",
                    "Darth Vader"
                ],
                [
                    "neon-green",
                    "glitter-covered"
                ],
                [
                    "lava lamp",
                    "marshmallow fluff"
                ],
                [
                    "Yoda",
                    "Willy Wonka"
                ],
                [
                    "smoothie",
                    "lava lamp"
                ]
            ],
            "six_word_story": "Three charged after soup attack on paintings."
        }
    ]
}