{
    "results": [
        {
            "style_code": "Style 1",
            "satirical_column": "In a move that can only be described as the academic equivalent of waterboarding, Peter Mandelson - the Dark Lord of New Labour and walking advertisement for the dangers of political necromancy - has suggested raising tuition fees to ease pressure on English universities. Because nothing says \"pressure relief\" quite like squeezing the last drops of financial hope from the already desiccated corpses of student bank accounts.\n\nMandelson, a man so slippery he makes eels look like they're covered in velcro, argues that increasing fees from £9,250 to £9,480 would provide \"stability.\" Ah yes, the stability of knowing you'll be in debt until the heat death of the universe. It's the kind of reassurance that makes you want to trade your degree for a handful of magic beans and a tin foil hat.\n\nBut wait, there's more! In a display of generosity that would make Ebenezer Scrooge blush, Mandelson suggests capping future increases at 2.5% annually. How thoughtful. At this rate, by 2050, students will be able to fund their education by simply selling a kidney, half their liver, and their firstborn child to the university bookshop.\n\nThe Labour peer, who's running to be Oxford University's next chancellor (because apparently, the position of \"Grand Inquisitor of Student Suffering\" was already filled), also proposes a more \"progressive\" loan repayment system. Under this scheme, graduates would start repaying at 2% of their income, increasing by 2 percentage points for each additional £10,000 earned. It's like a fun game of financial Jenga, where each block you pull out represents another slice of your soul being consumed by the insatiable maw of capitalism.\n\nMandelson claims this would be \"particularly beneficial for women.\" Yes, ladies, rejoice! Now you can pursue your dreams of nursing or teaching, secure in the knowledge that your comparatively low salaries will ensure you're trapped in a cycle of debt repayment until the end of time. It's feminism in action, folks!\n\nBut let's not forget the real victims here: the universities themselves. With only one teaching staff for every 13 students (compared to Italy's luxurious 1:21 ratio), how can we expect these bastions of learning to survive? Perhaps we could introduce a \"Hunger Games\" style competition for faculty positions. Last professor standing gets tenure and a slightly less soul-crushing workload.\n\nIn a final stroke of genius, Mandelson suggests focusing research on a smaller range of technologies as part of a national industrial strategy. Because nothing says \"innovation\" quite like putting all your eggs in one basket and hoping it doesn't get dropped off a cliff.\n\nSo there you have it, folks. Peter Mandelson's recipe for higher education success: raise fees, increase debt, narrow research focus, and pray to the ghost of Margaret Thatcher that it all somehow works out. It's a bold strategy, Cotton. Let's see if it pays off for 'em.\n\nIn the meantime, I suggest students start practicing their street performance skills. After all, when you're living in a cardboard box under a bridge, busking might be your only hope of ever paying off those loans. But hey, at least you'll have that degree in 14th-century Flemish poetry to keep you warm at night.",
            "headline": "Lord of the Pings: Mandelson's Tuition Fee Hike - A Masterclass in Bleeding Students Dry",
            "explanation": "The analogies in this satirical column are highly effective, as they use hyperbole and absurdity to underscore the grim reality of rising tuition fees and student debt. They paint vivid pictures that resonate with readers, using humor to critique the policies of Peter Mandelson. The analogies not only entertain but also provoke thought about the implications of these policies on students' lives, making the serious subject matter more accessible and engaging.",
            "analogy_1": "the academic equivalent of waterboarding",
            "analogy_2": "a fun game of financial Jenga, where each block you pull out represents another slice of your soul being consumed by the insatiable maw of capitalism",
            "analogy_3": "Hunger Games style competition for faculty positions",
            "scored_analogies": [
                {
                    "id": 1,
                    "style_code": "Style 1",
                    "analogy": "the academic equivalent of waterboarding",
                    "humor_score": 7,
                    "originality_score": 6,
                    "bite_score": 8,
                    "total_score": 21
                },
                {
                    "id": 2,
                    "style_code": "Style 1",
                    "analogy": "a fun game of financial Jenga, where each block you pull out represents another slice of your soul being consumed by the insatiable maw of capitalism",
                    "humor_score": 9,
                    "originality_score": 8,
                    "bite_score": 10,
                    "total_score": 27
                },
                {
                    "id": 3,
                    "style_code": "Style 1",
                    "analogy": "Hunger Games style competition for faculty positions",
                    "humor_score": 8,
                    "originality_score": 7,
                    "bite_score": 9,
                    "total_score": 24
                }
            ],
            "total_set_score": 72
        },
        {
            "style_code": "Style 2",
            "satirical_column": "In a dazzling display of fiscal acrobatics that would make even the most seasoned circus performer dizzy, our dear Lord of Darkness, Peter Mandelson, has once again emerged from the shadows to offer his two pence on the state of university funding. And what a glorious fever dream it is!\n\nPicture, if you will, a world where the solution to cash-strapped universities is not to, oh I don't know, adequately fund them, but instead to gently squeeze students for an extra £230 a year. It's like watching a magician pull not a rabbit from a hat, but a slightly larger hat from a slightly smaller hat. Bravo, Peter! Your sleight of hand is truly masterful.\n\nBut wait, there's more! In this hallucinogenic haze of higher education policy, Mandelson proposes a system where repayments start at a mere 2% of a graduate's income. How generous! It's as if he's taken a page from the 'Monopoly: Millennial Edition' rulebook, where landing on Park Lane means you have to forfeit your avocado toast for a month.\n\nAnd let's not forget the pièce de résistance: a progressive loan system that increases by 2 percentage points for each additional £10,000 earned, up to a maximum of 8%. It's like a game of Snake and Ladders, but instead of snakes, you have crushing debt, and instead of ladders, you have... well, more crushing debt, but with a fancy bow on top.\n\nOne can't help but wonder if Mandelson has been spending too much time in Oxford's Botanic Garden, mistaking some of the more exotic specimens for a light afternoon snack. How else to explain the psychedelic logic of suggesting that Italian universities, with their 1:21 staff-to-student ratio, are a model of efficiency to aspire to? Mamma mia! Next, we'll be told that the solution to NHS waiting times is to adopt the queueing system of the Roman Colosseum.\n\nBut fear not, dear readers! For in this brave new world of academia, where knowledge is power and power is about £9,480 a year plus interest, we have visionaries like Tim Leunig to guide us. His proposal? A minimum £10 weekly repayment for graduates. It's like a gym membership you never signed up for, but instead of sculpting your abs, you're toning your ability to live on baked beans and despair.\n\nAnd let's not overlook the cherry on top of this hallucinogenic sundae: Mandelson's suggestion to focus research on a \"smaller range of technologies.\" Because nothing says \"innovation\" quite like putting all your eggs in one basket, then juggling that basket while riding a unicycle on a tightrope over a pit of student debt.\n\nAs we stumble out of this acid trip of educational policy, one can't help but feel a twinge of nostalgia for the days when university was free and the biggest worry was whether to have chips or mash with your subsidized canteen lunch. But fear not, for in Mandelson's psychedelic paradise, the only limit is your imagination – and your credit score.\n\nSo raise a toast, dear students and academics, to the brave new world of higher education. May your degrees be ever valuable, your debts be ever manageable, and may you always remember: in the grand casino of life, the house always wins – and the house, in this case, wears a very expensive suit and answers to the name \"Lord Mandelson.\"",
            "headline": "Mandelson's Magical Money Tree: A Psychedelic Journey Through the Halls of Academia",
            "explanation": "The analogies used in this satirical column effectively highlight the absurdity and irony of the proposed educational policies. They create vivid imagery that captures the reader's attention while emphasizing the disconnect between the proposed solutions and the realities faced by students and universities. The comparisons also evoke humor and a sense of disbelief, making the critique more engaging and entertaining.",
            "analogy_1": "It's like watching a magician pull not a rabbit from a hat, but a slightly larger hat from a slightly smaller hat.",
            "analogy_2": "It's as if he's taken a page from the 'Monopoly: Millennial Edition' rulebook, where landing on Park Lane means you have to forfeit your avocado toast for a month.",
            "analogy_3": "It's like a gym membership you never signed up for, but instead of sculpting your abs, you're toning your ability to live on baked beans and despair.",
            "scored_analogies": [
                {
                    "id": 4,
                    "style_code": "Style 2",
                    "analogy": "It's like watching a magician pull not a rabbit from a hat, but a slightly larger hat from a slightly smaller hat.",
                    "humor_score": 7,
                    "originality_score": 8,
                    "bite_score": 6,
                    "total_score": 21
                },
                {
                    "id": 5,
                    "style_code": "Style 2",
                    "analogy": "It's as if he's taken a page from the 'Monopoly: Millennial Edition' rulebook, where landing on Park Lane means you have to forfeit your avocado toast for a month.",
                    "humor_score": 8,
                    "originality_score": 7,
                    "bite_score": 7,
                    "total_score": 22
                },
                {
                    "id": 6,
                    "style_code": "Style 2",
                    "analogy": "It's like a gym membership you never signed up for, but instead of sculpting your abs, you're toning your ability to live on baked beans and despair.",
                    "humor_score": 9,
                    "originality_score": 9,
                    "bite_score": 8,
                    "total_score": 26
                }
            ],
            "total_set_score": 69
        },
        {
            "style_code": "Style 3",
            "satirical_column": "In a stunning display of economic acrobatics that would make even the most seasoned circus performer blush, Lord Peter Mandelson has pirouetted onto the stage of higher education with a proposal so audacious, it could only have been conceived in the fever dreams of a neoliberal think tank on laughing gas.\n\nPicture, if you will, the grand ballroom of academia. The chandelier of knowledge flickers ominously as Lord Mandelson, resplendent in his ermine-trimmed robes and a jaunty mortarboard, takes center stage. With a flourish that would make Liberace look positively restrained, he unveils his grand plan: raise tuition fees! But wait, there's more! It's not just any raise – it's an inflation-linked raise. Be still, my beating student loan!\n\nAs I sit here, sipping my artisanal, fair-trade, organic coffee (because how else does one contemplate the machinations of the political elite?), I can't help but marvel at the sheer chutzpah of it all. It's as if Marie Antoinette, upon hearing that the peasants had no bread, suggested they try gluten-free croissants instead.\n\nBut fear not, dear reader, for Lord Mandelson assures us that this is all in the name of stability. Ah yes, the stability of knowing that your debt will grow as steadily as the ivy on those hallowed university walls. It's comforting, really, like the warm embrace of a straightjacket.\n\nAnd let's not forget the pièce de résistance of this fiscal fantasia: a new, progressive system of student loan repayments. It's so progressive, it's practically wearing Birkenstocks and composting its own receipts. Starting at a mere 2% of a graduate's income and increasing by 2 percentage points for each additional £10,000 earned, it's a veritable Jacob's Ladder of debt repayment. One can almost hear the faint strains of \"Climb Every Mountain\" playing in the background as graduates ascend the career ladder, their wallets growing ever lighter with each rung.\n\nBut wait! There's a twist in this tale worthy of M. Night Shyamalan himself. This new system, we're told, will be particularly beneficial for women. Yes, ladies, rejoice! Your comparatively low salaries in crucial public service roles like nursing will now be met with the gentle caress of a slightly less punitive repayment scheme. It's feminism in action, folks – brought to you by the man who once mistook guacamole for mushy peas.\n\nAs I ponder this brave new world of higher education financing, I can't help but think of my own college days. Back then, my biggest financial worry was whether I could afford to supersize my ramen noodles. Now, it seems, students will be grappling with financial models more complex than the plot of \"Inception\" – all while trying to decipher the hidden meanings in \"Ulysses\" and master the art of beer pong.\n\nIn the end, one has to admire Lord Mandelson's optimism. It takes a special kind of visionary to look at a generation already drowning in debt and think, \"You know what they need? Water wings made of lead.\" But perhaps I'm being too cynical. After all, in the grand tradition of British higher education, from Oxbridge to the red-brick universities, we've always believed in throwing students in at the deep end. Now, thanks to Lord Mandelson, they'll have the added challenge of fiscal weights tied to their ankles.\n\nSo raise a glass (of the cheapest supermarket own-brand spirits, naturally) to the future of higher education in England. May your degrees be as valuable as the paper they're printed on, and may your debt be as eternal as the very concept of knowledge itself. Cheers, Lord Mandelson, and God save the student loan!",
            "headline": "Lord Mandelson's Tuition Fee Tango: A Waltz Through the Ivory Tower's Cash Register",
            "explanation": "The analogies in the column effectively use humor and vivid imagery to critique Lord Mandelson's tuition fee proposal. They connect complex financial concepts to relatable and exaggerated scenarios, making the critique both entertaining and accessible. The analogies serve to highlight the absurdity of the situation and emphasize the impact on students, blending satire with social commentary.",
            "analogy_1": "It's as if Marie Antoinette, upon hearing that the peasants had no bread, suggested they try gluten-free croissants instead.",
            "analogy_2": "It's comforting, really, like the warm embrace of a straightjacket.",
            "analogy_3": "It takes a special kind of visionary to look at a generation already drowning in debt and think, 'You know what they need? Water wings made of lead.'",
            "scored_analogies": [
                {
                    "id": 7,
                    "style_code": "Style 3",
                    "analogy": "It's as if Marie Antoinette, upon hearing that the peasants had no bread, suggested they try gluten-free croissants instead.",
                    "humor_score": 9,
                    "originality_score": 8,
                    "bite_score": 10,
                    "total_score": 27
                },
                {
                    "id": 8,
                    "style_code": "Style 3",
                    "analogy": "It's comforting, really, like the warm embrace of a straightjacket.",
                    "humor_score": 6,
                    "originality_score": 7,
                    "bite_score": 5,
                    "total_score": 18
                },
                {
                    "id": 9,
                    "style_code": "Style 3",
                    "analogy": "It takes a special kind of visionary to look at a generation already drowning in debt and think, 'You know what they need? Water wings made of lead.'",
                    "humor_score": 10,
                    "originality_score": 9,
                    "bite_score": 10,
                    "total_score": 29
                }
            ],
            "total_set_score": 74,
            "labelled_analogies": [
                "It's as if {{Marie Antoinette}}, upon hearing that the peasants had no {{bread}}, suggested they try gluten-free croissants instead.",
                "It's comforting, really, like the warm embrace of a {{straightjacket}}.",
                "It takes a special kind of visionary to look at a generation already drowning in {{debt}} and think, 'You know what they need? Water wings made of lead.'"
            ],
            "processed_analogies": [
                "It's as if {1}, upon hearing that the peasants had no {2}, suggested they try gluten-free croissants instead.",
                "It's comforting, really, like the warm embrace of a {3}.",
                "It takes a special kind of visionary to look at a generation already drowning in {4} and think, 'You know what they need? Water wings made of lead.'"
            ],
            "giveaway_keywords": [
                {
                    "id": 1,
                    "answer": "Marie Antoinette"
                },
                {
                    "id": 2,
                    "answer": "bread"
                },
                {
                    "id": 3,
                    "answer": "straightjacket"
                },
                {
                    "id": 4,
                    "answer": "debt"
                }
            ],
            "alternative_sets": [
                {
                    "analogy_index": 0,
                    "original_analogy": "It's as if {1}, upon hearing that the peasants had no {2}, suggested they try gluten-free croissants instead.",
                    "alternative_sets": [
                        {
                            "analogy": "It's as if Kim Kardashian, upon hearing that the peasants had no WiFi, suggested they try gluten-free croissants instead.",
                            "alternative_words": {
                                "2": "WiFi",
                                "1": "Kim Kardashian"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 1,
                            "adjusted_score": 23
                        },
                        {
                            "analogy": "It's as if Elon Musk, upon hearing that the peasants had no unicorns, suggested they try gluten-free croissants instead.",
                            "alternative_words": {
                                "2": "unicorns",
                                "1": "Elon Musk"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 1,
                            "adjusted_score": 23
                        },
                        {
                            "analogy": "It's as if Donald Duck, upon hearing that the peasants had no Bitcoin, suggested they try gluten-free croissants instead.",
                            "alternative_words": {
                                "2": "Bitcoin",
                                "1": "Donald Duck"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "It's as if Bigfoot, upon hearing that the peasants had no kale smoothies, suggested they try gluten-free croissants instead.",
                            "alternative_words": {
                                "2": "kale smoothies",
                                "1": "Bigfoot"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "It's as if The Tooth Fairy, upon hearing that the peasants had no cat memes, suggested they try gluten-free croissants instead.",
                            "alternative_words": {
                                "2": "cat memes",
                                "1": "The Tooth Fairy"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "It's as if Kim Kardashian, upon hearing that the peasants had no WiFi, suggested they try gluten-free croissants instead.",
                                "alternative_words": {
                                    "2": "WiFi",
                                    "1": "Kim Kardashian"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 9
                                },
                                "total_score": 24,
                                "similarity_score": 1,
                                "adjusted_score": 23
                            },
                            {
                                "analogy": "It's as if Elon Musk, upon hearing that the peasants had no unicorns, suggested they try gluten-free croissants instead.",
                                "alternative_words": {
                                    "2": "unicorns",
                                    "1": "Elon Musk"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 9
                                },
                                "total_score": 24,
                                "similarity_score": 1,
                                "adjusted_score": 23
                            }
                        ]
                    }
                },
                {
                    "analogy_index": 1,
                    "original_analogy": "It's comforting, really, like the warm embrace of a {3}.",
                    "alternative_sets": [
                        {
                            "analogy": "It's comforting, really, like the warm embrace of a tinfoil hat.",
                            "alternative_words": {
                                "3": "tinfoil hat"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 2,
                            "adjusted_score": 19
                        },
                        {
                            "analogy": "It's comforting, really, like the warm embrace of a yoga pants.",
                            "alternative_words": {
                                "3": "yoga pants"
                            },
                            "scores": {
                                "originality_score": 6,
                                "humor_score": 7,
                                "bite_score": 4
                            },
                            "total_score": 17,
                            "similarity_score": 2,
                            "adjusted_score": 15
                        },
                        {
                            "analogy": "It's comforting, really, like the warm embrace of a onesie.",
                            "alternative_words": {
                                "3": "onesie"
                            },
                            "scores": {
                                "originality_score": 7,
                                "humor_score": 6,
                                "bite_score": 3
                            },
                            "total_score": 16,
                            "similarity_score": 2,
                            "adjusted_score": 14
                        },
                        {
                            "analogy": "It's comforting, really, like the warm embrace of a bubble wrap.",
                            "alternative_words": {
                                "3": "bubble wrap"
                            },
                            "scores": {
                                "originality_score": 7,
                                "humor_score": 6,
                                "bite_score": 3
                            },
                            "total_score": 16,
                            "similarity_score": 2,
                            "adjusted_score": 14
                        },
                        {
                            "analogy": "It's comforting, really, like the warm embrace of a snuggie.",
                            "alternative_words": {
                                "3": "snuggie"
                            },
                            "scores": {
                                "originality_score": 6,
                                "humor_score": 5,
                                "bite_score": 2
                            },
                            "total_score": 13,
                            "similarity_score": 2,
                            "adjusted_score": 11
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "It's comforting, really, like the warm embrace of a tinfoil hat.",
                                "alternative_words": {
                                    "3": "tinfoil hat"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 6
                                },
                                "total_score": 21,
                                "similarity_score": 2,
                                "adjusted_score": 19
                            },
                            {
                                "analogy": "It's comforting, really, like the warm embrace of a yoga pants.",
                                "alternative_words": {
                                    "3": "yoga pants"
                                },
                                "scores": {
                                    "originality_score": 6,
                                    "humor_score": 7,
                                    "bite_score": 4
                                },
                                "total_score": 17,
                                "similarity_score": 2,
                                "adjusted_score": 15
                            }
                        ]
                    }
                },
                {
                    "analogy_index": 2,
                    "original_analogy": "It takes a special kind of visionary to look at a generation already drowning in {4} and think, 'You know what they need? Water wings made of lead.'",
                    "alternative_sets": [
                        {
                            "analogy": "It takes a special kind of visionary to look at a generation already drowning in bad haircut and think, 'You know what they need? Water wings made of lead.'",
                            "alternative_words": {
                                "4": "bad haircut"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 3,
                            "adjusted_score": 21
                        },
                        {
                            "analogy": "It takes a special kind of visionary to look at a generation already drowning in sibling rivalry and think, 'You know what they need? Water wings made of lead.'",
                            "alternative_words": {
                                "4": "sibling rivalry"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 3,
                            "adjusted_score": 21
                        },
                        {
                            "analogy": "It takes a special kind of visionary to look at a generation already drowning in hangover and think, 'You know what they need? Water wings made of lead.'",
                            "alternative_words": {
                                "4": "hangover"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 3,
                            "adjusted_score": 21
                        },
                        {
                            "analogy": "It takes a special kind of visionary to look at a generation already drowning in pet rock collection and think, 'You know what they need? Water wings made of lead.'",
                            "alternative_words": {
                                "4": "pet rock collection"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 8,
                                "bite_score": 7
                            },
                            "total_score": 24,
                            "similarity_score": 3,
                            "adjusted_score": 21
                        },
                        {
                            "analogy": "It takes a special kind of visionary to look at a generation already drowning in laundry pile and think, 'You know what they need? Water wings made of lead.'",
                            "alternative_words": {
                                "4": "laundry pile"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 8
                            },
                            "total_score": 23,
                            "similarity_score": 3,
                            "adjusted_score": 20
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "It takes a special kind of visionary to look at a generation already drowning in bad haircut and think, 'You know what they need? Water wings made of lead.'",
                                "alternative_words": {
                                    "4": "bad haircut"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 9
                                },
                                "total_score": 24,
                                "similarity_score": 3,
                                "adjusted_score": 21
                            },
                            {
                                "analogy": "It takes a special kind of visionary to look at a generation already drowning in sibling rivalry and think, 'You know what they need? Water wings made of lead.'",
                                "alternative_words": {
                                    "4": "sibling rivalry"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 9
                                },
                                "total_score": 24,
                                "similarity_score": 3,
                                "adjusted_score": 21
                            }
                        ]
                    }
                }
            ],
            "final_alternative_keywords": [
                [
                    "WiFi",
                    "unicorns"
                ],
                [
                    "Kim Kardashian",
                    "Elon Musk"
                ],
                [
                    "yoga pants",
                    "tinfoil hat"
                ],
                [
                    "bad haircut",
                    "sibling rivalry"
                ]
            ],
            "six_word_story": "Mandelson proposes tuition fee increase for universities."
        }
    ]
}