{
    "results": [
        {
            "style_code": "Style 1",
            "satirical_column": "In a stunning display of culinary artistry, three individuals have elevated Van Gogh's Sunflowers from mere visual masterpiece to gastronomic sensation. Move over, Andy Warhol's Campbell's Soup Cans – there's a new soupy artwork in town.\n\nThe National Gallery's \"Poets and Lovers\" exhibition took an unexpected turn when Stephen Simpson, Mary Somerville, and Phillipa Green decided to add their own special ingredient to Van Gogh's triptych: a hearty serving of orange soup. One can only assume they felt the Dutch master's work was lacking in Vitamin C.\n\nAs someone who's always thought art galleries could use more food fights, I applaud their innovative approach. After all, why should we limit ourselves to merely feasting our eyes on great art when we could be feasting our stomachs as well? I eagerly await the day when the Mona Lisa is improved with a generous dollop of guacamole.\n\nThe Metropolitan Police, ever the killjoys, have charged the trio with \"causing criminal damage.\" Personally, I think they should be charged with \"causing criminal deliciousness.\" It's about time someone spiced up these stuffy galleries – and I mean that literally.\n\nThe National Gallery assures us that both paintings are undamaged, which is a relief. Heaven forbid we lose these priceless works of art to a bit of Campbell's Cream of Tomato. Although, let's be honest, if Van Gogh were alive today, he'd probably be more upset about the soup's color clashing with his carefully chosen palette.\n\nThis incident raises some pressing questions: Was this a misguided attempt at creating the world's most expensive soup kitchen? Or perhaps a protest against the rising cost of living, where even a tin of soup now requires a heist at the National Gallery?\n\nAs for the choice of Sunflowers, one can't help but wonder if our culinary vandals were making a poignant statement about climate change. \"See these lovely flowers, Vincent? This is what they'll look like after we've boiled the planet.\"\n\nIn the end, this soupy saga serves as a reminder that art is meant to provoke a reaction. And what reaction is more visceral than the urge to hurl one's lunch at a priceless masterpiece? So the next time you're at a gallery, remember: appreciation comes in many forms. Some people gasp in awe, others nod thoughtfully, and a select few bring condiments.\n\nAs for Van Gogh, I like to think he'd appreciate the gesture. After all, this is a man who once said, \"I dream of painting and then I paint my dream.\" Little did he know that in 2023, someone would dream of soup and then soup his painting. Now that's what I call artistic progress.",
            "headline": "Van Gogh's Sunflowers: Now Available in Soup Form",
            "explanation": "The analogies in this satirical column effectively juxtapose the worlds of fine art and culinary creativity, using humor to highlight the absurdity of transforming a revered painting into a soup. The comparisons made are bold and playful, inviting the reader to reconsider the boundaries of art and food. The analogies also serve to critique the stuffiness of art galleries and the often pretentious nature of art appreciation, suggesting that art could be more enjoyable and accessible. They are effective in eliciting laughter while prompting deeper thoughts about the relationship between art and everyday life.",
            "analogy_1": "After all, why should we limit ourselves to merely feasting our eyes on great art when we could be feasting our stomachs as well?",
            "analogy_2": "This is a man who once said, 'I dream of painting and then I paint my dream.' Little did he know that in 2023, someone would dream of soup and then soup his painting.",
            "analogy_3": "As for the choice of Sunflowers, one can't help but wonder if our culinary vandals were making a poignant statement about climate change. 'See these lovely flowers, Vincent? This is what they'll look like after we've boiled the planet.'",
            "scored_analogies": [
                {
                    "id": 1,
                    "style_code": "Style 1",
                    "analogy": "After all, why should we limit ourselves to merely feasting our eyes on great art when we could be feasting our stomachs as well?",
                    "humor_score": 7,
                    "originality_score": 6,
                    "bite_score": 5,
                    "total_score": 18
                },
                {
                    "id": 2,
                    "style_code": "Style 1",
                    "analogy": "This is a man who once said, 'I dream of painting and then I paint my dream.' Little did he know that in 2023, someone would dream of soup and then soup his painting.",
                    "humor_score": 8,
                    "originality_score": 8,
                    "bite_score": 6,
                    "total_score": 22
                },
                {
                    "id": 3,
                    "style_code": "Style 1",
                    "analogy": "As for the choice of Sunflowers, one can't help but wonder if our culinary vandals were making a poignant statement about climate change. 'See these lovely flowers, Vincent? This is what they'll look like after we've boiled the planet.'",
                    "humor_score": 9,
                    "originality_score": 9,
                    "bite_score": 8,
                    "total_score": 26
                }
            ],
            "total_set_score": 66
        },
        {
            "style_code": "Style 2",
            "satirical_column": "In a world where reality has become as malleable as a Dalí clock, it seems only fitting that the latest battleground in the war against climate change would be fought with canned vegetables and century-old paintings. Yes, dear readers, we've entered the epoch of the Great Soup Offensive, where activists armed with Campbell's finest are taking on the art world one masterpiece at a time.\n\nPicture this: Three modern-day Don Quixotes - let's call them the Souper Troopers - decided that the best way to save the planet was to give Van Gogh's Sunflowers an impromptu orange shower. It's as if they looked at the vibrant yellows of the iconic paintings and thought, \"You know what this needs? A splash of Heinz.\" \n\nOne can only imagine the scene at the National Gallery. There stood Stephen Simpson, 61, Mary Somerville, 77, and Phillipa Green, 24 - a veritable Neapolitan ice cream of generational protest - ready to unleash their culinary critique on unsuspecting Dutch Post-Impressionism. \n\nIt's a tale as old as time: Girl meets boy, boy meets septuagenarian, septuagenarian meets soup can, soup can meets priceless artwork. Shakespeare could never.\n\nBut let's not judge too harshly. After all, in a world where NFTs of pixelated apes are selling for millions, perhaps dousing physical art in soup is simply the next logical step in our collective descent into madness. It's performance art for the apocalypse - a bold statement that screams, \"We're so concerned about the future, we're willing to desecrate the past!\"\n\nOne can't help but wonder what Van Gogh himself would make of this soupy situation. The man who once said, \"I dream of painting and then I paint my dream,\" probably never envisioned his dreams would one day be served with a side of minestrone. \n\nAnd let's not overlook the sheer poetry of the moment. Orange soup on Sunflowers? It's like a cosmic joke, a culinary eclipse, a gastronomic homage to the very sun that Van Gogh so lovingly captured. Or perhaps it's a scathing commentary on the Dutch's infamous love for orange. Either way, it's safe to say that art critics will be chewing on this one for years to come.\n\nBut fear not, art lovers! The National Gallery assures us that both paintings remain unharmed, protected by their glass cases like rare butterflies in a world gone mad. It seems even in our post-truth era, some things remain impervious to the chaos - a comforting thought in these soupy times.\n\nAs for our intrepid Souper Troopers, they now face charges of criminal damage. One can only hope that when they appear at Westminster Magistrates' Court, they'll be greeted by a judge wielding a giant spoon, ready to serve justice with a side of irony.\n\nIn the end, perhaps this incident is less about climate change and more a poignant commentary on the state of British cuisine. In a country where beans on toast is considered a delicacy, is it any wonder that some might view soup as a weapon of mass destruction?\n\nSo, as we navigate this brave new world where art galleries double as potential soup kitchens, let us take a moment to reflect. In the grand canvas of life, are we the artists or the soup? Are we the sunflowers or the can opener? These are the questions that will haunt us as we drift off to sleep tonight, dreaming of a world where Van Gogh paints Campbell's soup cans and Warhol crafts exquisite Dutch landscapes.\n\nAnd remember, dear readers, in these trying times, stay vigilant, stay informed, and above all, stay away from the condiment aisle if you're planning a trip to the National Gallery. The future of art depends on it.",
            "headline": "Sunflowers in Soup: When Post-Impressionism Meets Post-Truth Absurdism",
            "explanation": "The analogies in this satirical column effectively juxtapose the absurdity of modern activism with the revered world of art, creating a humorous and thought-provoking commentary on both subjects. The comparisons to well-known cultural references, such as Don Quixote and Shakespeare, enhance the entertainment value while highlighting the surreal nature of the events described. Each analogy invites readers to reflect on the bizarre intersection of art, protest, and societal norms, making the column both engaging and memorable.",
            "analogy_1": "In a world where reality has become as malleable as a Dalí clock",
            "analogy_2": "It's performance art for the apocalypse - a bold statement that screams, \"We're so concerned about the future, we're willing to desecrate the past!\"",
            "analogy_3": "Orange soup on Sunflowers? It's like a cosmic joke, a culinary eclipse, a gastronomic homage to the very sun that Van Gogh so lovingly captured.",
            "scored_analogies": [
                {
                    "id": 4,
                    "style_code": "Style 2",
                    "analogy": "In a world where reality has become as malleable as a Dalí clock",
                    "humor_score": 6,
                    "originality_score": 7,
                    "bite_score": 5,
                    "total_score": 18
                },
                {
                    "id": 5,
                    "style_code": "Style 2",
                    "analogy": "It's performance art for the apocalypse - a bold statement that screams, 'We're so concerned about the future, we're willing to desecrate the past!'",
                    "humor_score": 8,
                    "originality_score": 8,
                    "bite_score": 9,
                    "total_score": 25
                },
                {
                    "id": 6,
                    "style_code": "Style 2",
                    "analogy": "Orange soup on Sunflowers? It's like a cosmic joke, a culinary eclipse, a gastronomic homage to the very sun that Van Gogh so lovingly captured.",
                    "humor_score": 9,
                    "originality_score": 9,
                    "bite_score": 7,
                    "total_score": 25
                }
            ],
            "total_set_score": 68,
            "labelled_analogies": [
                "In a world where reality has become as malleable as a {{Dalí}} clock",
                "It's performance art for the apocalypse - a bold statement that screams, 'We're so concerned about the future, we're willing to {{desecrate}} the past!'",
                "{{Orange soup}} on {{Sunflowers}}? It's like a cosmic joke, a culinary eclipse, a gastronomic homage to the very sun that {{Van Gogh}} so lovingly captured."
            ],
            "processed_analogies": [
                "In a world where reality has become as malleable as a {1} clock",
                "It's performance art for the apocalypse - a bold statement that screams, 'We're so concerned about the future, we're willing to {2} the past!'",
                "{3} on {4}? It's like a cosmic joke, a culinary eclipse, a gastronomic homage to the very sun that {5} so lovingly captured."
            ],
            "giveaway_keywords": [
                {
                    "id": 1,
                    "answer": "Dalí"
                },
                {
                    "id": 2,
                    "answer": "desecrate"
                },
                {
                    "id": 3,
                    "answer": "Orange soup"
                },
                {
                    "id": 4,
                    "answer": "Sunflowers"
                },
                {
                    "id": 5,
                    "answer": "Van Gogh"
                }
            ],
            "alternative_sets": [
                {
                    "analogy_index": 0,
                    "original_analogy": "In a world where reality has become as malleable as a {1} clock",
                    "alternative_sets": [
                        {
                            "analogy": "In a world where reality has become as malleable as a Picasso clock",
                            "alternative_words": {
                                "1": "Picasso"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 6,
                                "bite_score": 7
                            },
                            "total_score": 21,
                            "similarity_score": 3,
                            "adjusted_score": 18
                        },
                        {
                            "analogy": "In a world where reality has become as malleable as a Warhol clock",
                            "alternative_words": {
                                "1": "Warhol"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 6,
                                "bite_score": 7
                            },
                            "total_score": 21,
                            "similarity_score": 3,
                            "adjusted_score": 18
                        },
                        {
                            "analogy": "In a world where reality has become as malleable as a Banksy clock",
                            "alternative_words": {
                                "1": "Banksy"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 6,
                                "bite_score": 7
                            },
                            "total_score": 21,
                            "similarity_score": 3,
                            "adjusted_score": 18
                        },
                        {
                            "analogy": "In a world where reality has become as malleable as a Bob Ross clock",
                            "alternative_words": {
                                "1": "Bob Ross"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 3,
                            "adjusted_score": 18
                        },
                        {
                            "analogy": "In a world where reality has become as malleable as a The Mona Lisa clock",
                            "alternative_words": {
                                "1": "The Mona Lisa"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 6,
                                "bite_score": 7
                            },
                            "total_score": 21,
                            "similarity_score": 3,
                            "adjusted_score": 18
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "In a world where reality has become as malleable as a Picasso clock",
                                "alternative_words": {
                                    "1": "Picasso"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 6,
                                    "bite_score": 7
                                },
                                "total_score": 21,
                                "similarity_score": 3,
                                "adjusted_score": 18
                            },
                            {
                                "analogy": "In a world where reality has become as malleable as a Warhol clock",
                                "alternative_words": {
                                    "1": "Warhol"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 6,
                                    "bite_score": 7
                                },
                                "total_score": 21,
                                "similarity_score": 3,
                                "adjusted_score": 18
                            }
                        ]
                    }
                },
                {
                    "analogy_index": 1,
                    "original_analogy": "It's performance art for the apocalypse - a bold statement that screams, 'We're so concerned about the future, we're willing to {2} the past!'",
                    "alternative_sets": [
                        {
                            "analogy": "It's performance art for the apocalypse - a bold statement that screams, 'We're so concerned about the future, we're willing to vandalize the past!'",
                            "alternative_words": {
                                "2": "vandalize"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 8,
                                "bite_score": 9
                            },
                            "total_score": 26,
                            "similarity_score": 4,
                            "adjusted_score": 22
                        },
                        {
                            "analogy": "It's performance art for the apocalypse - a bold statement that screams, 'We're so concerned about the future, we're willing to annoy the past!'",
                            "alternative_words": {
                                "2": "annoy"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 8,
                                "bite_score": 7
                            },
                            "total_score": 24,
                            "similarity_score": 4,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "It's performance art for the apocalypse - a bold statement that screams, 'We're so concerned about the future, we're willing to irritate the past!'",
                            "alternative_words": {
                                "2": "irritate"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 4,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "It's performance art for the apocalypse - a bold statement that screams, 'We're so concerned about the future, we're willing to disrupt the past!'",
                            "alternative_words": {
                                "2": "disrupt"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 6,
                                "bite_score": 7
                            },
                            "total_score": 21,
                            "similarity_score": 4,
                            "adjusted_score": 17
                        },
                        {
                            "analogy": "It's performance art for the apocalypse - a bold statement that screams, 'We're so concerned about the future, we're willing to tickle the past!'",
                            "alternative_words": {
                                "2": "tickle"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 4,
                            "adjusted_score": 17
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "It's performance art for the apocalypse - a bold statement that screams, 'We're so concerned about the future, we're willing to vandalize the past!'",
                                "alternative_words": {
                                    "2": "vandalize"
                                },
                                "scores": {
                                    "originality_score": 9,
                                    "humor_score": 8,
                                    "bite_score": 9
                                },
                                "total_score": 26,
                                "similarity_score": 4,
                                "adjusted_score": 22
                            },
                            {
                                "analogy": "It's performance art for the apocalypse - a bold statement that screams, 'We're so concerned about the future, we're willing to annoy the past!'",
                                "alternative_words": {
                                    "2": "annoy"
                                },
                                "scores": {
                                    "originality_score": 9,
                                    "humor_score": 8,
                                    "bite_score": 7
                                },
                                "total_score": 24,
                                "similarity_score": 4,
                                "adjusted_score": 20
                            }
                        ]
                    }
                },
                {
                    "analogy_index": 2,
                    "original_analogy": "{3} on {4}? It's like a cosmic joke, a culinary eclipse, a gastronomic homage to the very sun that {5} so lovingly captured.",
                    "alternative_sets": [
                        {
                            "analogy": "butternut squash puree on plastic flowers? It's like a cosmic joke, a culinary eclipse, a gastronomic homage to the very sun that Bob the Builder so lovingly captured.",
                            "alternative_words": {
                                "5": "Bob the Builder",
                                "4": "plastic flowers",
                                "3": "butternut squash puree"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 8,
                                "bite_score": 7
                            },
                            "total_score": 24,
                            "similarity_score": 2,
                            "adjusted_score": 22
                        },
                        {
                            "analogy": "carrot smoothie on tulips? It's like a cosmic joke, a culinary eclipse, a gastronomic homage to the very sun that Rembrandt so lovingly captured.",
                            "alternative_words": {
                                "5": "Rembrandt",
                                "4": "tulips",
                                "3": "carrot smoothie"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 22,
                            "similarity_score": 2,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "mango salsa on dandelions? It's like a cosmic joke, a culinary eclipse, a gastronomic homage to the very sun that Da Vinci so lovingly captured.",
                            "alternative_words": {
                                "5": "Da Vinci",
                                "4": "dandelions",
                                "3": "mango salsa"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 2,
                            "adjusted_score": 19
                        },
                        {
                            "analogy": "cheddar fondue on cacti? It's like a cosmic joke, a culinary eclipse, a gastronomic homage to the very sun that Michelangelo so lovingly captured.",
                            "alternative_words": {
                                "5": "Michelangelo",
                                "4": "cacti",
                                "3": "cheddar fondue"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 7,
                                "bite_score": 5
                            },
                            "total_score": 21,
                            "similarity_score": 2,
                            "adjusted_score": 19
                        },
                        {
                            "analogy": "pumpkin latte on roses? It's like a cosmic joke, a culinary eclipse, a gastronomic homage to the very sun that Monet so lovingly captured.",
                            "alternative_words": {
                                "5": "Monet",
                                "4": "roses",
                                "3": "pumpkin latte"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 6,
                                "bite_score": 5
                            },
                            "total_score": 19,
                            "similarity_score": 2,
                            "adjusted_score": 17
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "butternut squash puree on plastic flowers? It's like a cosmic joke, a culinary eclipse, a gastronomic homage to the very sun that Bob the Builder so lovingly captured.",
                                "alternative_words": {
                                    "5": "Bob the Builder",
                                    "4": "plastic flowers",
                                    "3": "butternut squash puree"
                                },
                                "scores": {
                                    "originality_score": 9,
                                    "humor_score": 8,
                                    "bite_score": 7
                                },
                                "total_score": 24,
                                "similarity_score": 2,
                                "adjusted_score": 22
                            },
                            {
                                "analogy": "carrot smoothie on tulips? It's like a cosmic joke, a culinary eclipse, a gastronomic homage to the very sun that Rembrandt so lovingly captured.",
                                "alternative_words": {
                                    "5": "Rembrandt",
                                    "4": "tulips",
                                    "3": "carrot smoothie"
                                },
                                "scores": {
                                    "originality_score": 9,
                                    "humor_score": 7,
                                    "bite_score": 6
                                },
                                "total_score": 22,
                                "similarity_score": 2,
                                "adjusted_score": 20
                            }
                        ]
                    }
                }
            ],
            "final_alternative_keywords": [
                [
                    "Warhol",
                    "Picasso"
                ],
                [
                    "annoy",
                    "vandalize"
                ],
                [
                    "Bob the Builder",
                    "Rembrandt"
                ],
                [
                    "plastic flowers",
                    "tulips"
                ],
                [
                    "butternut squash puree",
                    "carrot smoothie"
                ]
            ],
            "six_word_story": "Three charged after soup attacks Van Gogh."
        },
        {
            "style_code": "Style 3",
            "satirical_column": "In a world where climate change threatens to boil us alive, it seems some activists have decided to get a head start by simmering Van Gogh's sunflowers. As I strolled through the National Gallery, nursing my seventh espresso and contemplating the existential dread that comes with being a middle-aged man in skinny jeans, I couldn't help but marvel at the latest culinary art installation.\n\nTwo of Van Gogh's \"Sunflowers\" paintings, those vibrant yellow harbingers of joy and madness, received an unexpected marinara makeover courtesy of three avant-garde \"chefs.\" Stephen Simpson, 61, Mary Somerville, 77, and Phillipa Green, 24 - a trio that sounds like the setup for a bar joke about generational warfare - decided to elevate Van Gogh's work from mere visual feast to literal amuse-bouche.\n\nAs I stood there, watching the orange rivulets cascade down the canvas like the tears of art history professors everywhere, I couldn't help but think: \"Finally, someone's brave enough to address the severe lack of lycopene in 19th-century post-impressionism.\"\n\nThe gallery quickly removed the paintings for \"examination,\" no doubt by a team of highly trained sommeliers who will declare notes of \"protest,\" \"misguided idealism,\" and a \"hint of Heinz.\" I imagine Van Gogh himself, were he alive today, might have appreciated the gesture. After all, this is a man who once said, \"I dream of painting and then I paint my dream.\" Though I doubt he ever dreamed of his work being paired with a nice Chianti and some fava beans.\n\nThe irony, of course, is that Van Gogh's sunflowers were already a striking commentary on the fleeting nature of beauty and the cyclical death and rebirth in nature. By attempting to \"destroy\" these paintings, our soup-wielding critics have inadvertently emphasized their immortality. The artworks emerged unscathed, while the protesters face charges of criminal damage and poor taste in both art criticism and soup selection.\n\nAs I left the gallery, dodging tourists armed with selfie sticks and overpriced gift shop tote bags, I couldn't shake the feeling that this incident was a perfect metaphor for our times. In an age where everyone's vying for their 15 minutes of fame, some opt for the tomato-tinted variety. And while Van Gogh cut off his ear to prove his love, these modern-day artists merely opened a can to prove their point.\n\nSo here's to you, Simpson, Somerville, and Green - the holy trinity of misguided activism. May your court appearance be as riveting as watching paint dry, and may your next protest consider the subtle nuances of a nice gazpacho instead. After all, if you're going to critique capitalism through the medium of tinned goods, you might as well make it palatable.",
            "headline": "Soup du Jour: A Tasteless Tribute to Van Gogh's Palette",
            "explanation": "The analogies in this satirical column effectively highlight the absurdity of the activists' actions by comparing their culinary vandalism to Van Gogh's artistic intent, as well as to broader themes of modern activism and societal critique. The column uses humor and vivid imagery to engage the reader while drawing parallels between the destruction of art for protest and the nature of art itself.",
            "analogy_1": "the orange rivulets cascade down the canvas like the tears of art history professors everywhere",
            "analogy_2": "this incident was a perfect metaphor for our times",
            "analogy_3": "these modern-day artists merely opened a can to prove their point",
            "scored_analogies": [
                {
                    "id": 7,
                    "style_code": "Style 3",
                    "analogy": "the orange rivulets cascade down the canvas like the tears of art history professors everywhere",
                    "humor_score": 8,
                    "originality_score": 7,
                    "bite_score": 9,
                    "total_score": 24
                },
                {
                    "id": 8,
                    "style_code": "Style 3",
                    "analogy": "this incident was a perfect metaphor for our times",
                    "humor_score": 5,
                    "originality_score": 6,
                    "bite_score": 5,
                    "total_score": 16
                },
                {
                    "id": 9,
                    "style_code": "Style 3",
                    "analogy": "these modern-day artists merely opened a can to prove their point",
                    "humor_score": 7,
                    "originality_score": 6,
                    "bite_score": 7,
                    "total_score": 20
                }
            ],
            "total_set_score": 60
        }
    ]
}