{
    "results": [
        {
            "style_code": "Style 1",
            "satirical_column": "In a cosmic twist that would make Douglas Adams chuckle, Earth is set to temporarily adopt a second moon this autumn. Scientists, those killjoys of the celestial realm, have informed us that this 'mini-moon' is actually just a small asteroid with delusions of lunar grandeur. \n\nOne can't help but wonder if this is Mother Nature's attempt at providing affordable housing solutions. \"Can't afford rent in London? Why not try our new lunar annex? Great views, no air, perfect for those looking to escape the rat race... literally.\"\n\nThe new arrival, dubbed 2024 PT5 (clearly, NASA's Department of Naming Things is as creative as a Brexit negotiator), hails from the Arjuna asteroid belt. It's essentially the cosmic equivalent of that weird cousin who shows up uninvited, crashes on your sofa for a couple of months, and then disappears without so much as a 'thank you' note.\n\nAt a mere 32 feet long, our new celestial roommate is about as impressive as Rishi Sunak's economic policy. It's so small and dim that even professional stargazers will struggle to spot it without industrial-grade equipment. In other words, it's the Paris Hilton of astronomical bodies - famous for being famous, but ultimately inconsequential.\n\nThe timing of this cosmic visitation is impeccable. Just as humanity grapples with climate change, political turmoil, and the eternal question of whether pineapple belongs on pizza, the universe decides to throw us a curve ball. It's as if the cosmos looked down, saw our pitiful attempts at solving our problems, and said, \"Hold my beer.\"\n\nScientists assure us that this mini-moon poses no threat to Earth. Unlike certain politicians, it will quietly orbit for a couple of months before buggering off. One can't help but wish some of our terrestrial leaders would take a cue from this celestial visitor and make their stays equally brief.\n\nDr. Jennifer Millard, an astronomer clearly thrilled by the prospect of a dot moving past stars, enthused about the importance of monitoring the night sky. One can only hope that while we're busy stargazing, someone remembers to keep an eye on the dumpster fire that is our current geopolitical situation.\n\nIn a final cosmic joke, the asteroid is set to return in 2055. By then, we'll either have colonized Mars, perfected fusion energy, and achieved world peace, or we'll be living in a 'Mad Max' hellscape fighting over the last remaining Twinkies. Either way, at least we'll have a new moon to admire.\n\nSo, as we prepare to welcome our new celestial squatter, let's raise a glass to the absurdity of the cosmos. In a world where even the moon can't commit to a long-term relationship with Earth, perhaps we should all take a moment to appreciate the fleeting nature of existence. And maybe, just maybe, use those professional telescopes to look for signs of intelligent life. God knows we could use some down here.",
            "headline": "Celestial Squatter: Earth's New Moon Arrives Just in Time for Housing Crisis",
            "explanation": "The analogies in this satirical column effectively highlight the absurdity of the situation by comparing the new mini-moon to relatable earthly concepts, making the commentary more impactful and entertaining. They draw parallels between cosmic events and human experiences, emphasizing themes of impermanence and the struggles of modern life.",
            "analogy_1": "Great views, no air, perfect for those looking to escape the rat race... literally.",
            "analogy_2": "It's essentially the cosmic equivalent of that weird cousin who shows up uninvited, crashes on your sofa for a couple of months, and then disappears without so much as a 'thank you' note.",
            "analogy_3": "It's the Paris Hilton of astronomical bodies - famous for being famous, but ultimately inconsequential.",
            "scored_analogies": [
                {
                    "id": 1,
                    "style_code": "Style 1",
                    "analogy": "Great views, no air, perfect for those looking to escape the rat race... literally.",
                    "humor_score": 7,
                    "originality_score": 6,
                    "bite_score": 5,
                    "total_score": 18
                },
                {
                    "id": 2,
                    "style_code": "Style 1",
                    "analogy": "It's essentially the cosmic equivalent of that weird cousin who shows up uninvited, crashes on your sofa for a couple of months, and then disappears without so much as a 'thank you' note.",
                    "humor_score": 9,
                    "originality_score": 8,
                    "bite_score": 7,
                    "total_score": 24
                },
                {
                    "id": 3,
                    "style_code": "Style 1",
                    "analogy": "It's the Paris Hilton of astronomical bodies - famous for being famous, but ultimately inconsequential.",
                    "humor_score": 8,
                    "originality_score": 7,
                    "bite_score": 8,
                    "total_score": 23
                }
            ],
            "total_set_score": 65
        },
        {
            "style_code": "Style 2",
            "satirical_column": "In a twist that would make even the most ardent flat-earthers scratch their globular heads, our dear planet Earth is about to become a reluctant foster parent to a celestial delinquent. Yes, ladies and gentlemen, we're getting a second moon. But before you start planning your romantic double-moonlit picnics, let me burst your bubble faster than a meteorite entering our atmosphere.\n\nThis new 'moon', affectionately dubbed 2024 PT5 by scientists (who clearly missed their calling as poets), is less 'moon' and more 'space pebble with delusions of grandeur'. At a measly 32 feet long, it's about as impressive as a politician's promise and just as fleeting. It's set to grace us with its presence from September 29th to November 25th, a cosmic one-night stand that somehow lasted two months.\n\nBut oh, the drama it has unleashed! The Moon, our faithful companion for eons, is reportedly throwing tantrums that would make a supernova blush. Sources close to the lunar surface report that the Moon has been seen hurling cheese at Earth and threatening to elope with Mars if we don't \"send that asteroid back where it came from\". \n\nMeanwhile, the asteroid belt is in uproar. The Arjuna family of asteroids, from whence our little visitor hails, has filed for joint custody. They argue that Earth's gravitational pull is nothing short of kidnapping, and demand visitation rights every 30 years. The case is set to be heard in the Intergalactic Court of Celestial Bodies, where Judge Jupiter will preside, assuming he can tear himself away from his ongoing gas giant diet.\n\nNASA, ever the voice of reason in this cosmic circus, has assured us that the mini-moon poses no threat. However, they did admit to being slightly concerned that if word gets out, Jeff Bezos might try to claim it as a tax haven.\n\nIn a surprising turn of events, flat-earthers have embraced this news with unexpected enthusiasm. Their new theory? The Earth is actually a cosmic Pac-Man, gobbling up space rocks as it zips through the universe. When presented with the obvious flaws in this logic, their spokesperson, Planar Pete, simply replied, \"Well, it makes about as much sense as a round Earth, doesn't it?\"\n\nAs for the rest of us, we're left to ponder the existential implications of our brief dalliance with bigamy. Will our tides become more indecisive than a millennial in a craft beer shop? Will werewolves experience a brief identity crisis? And most importantly, will conspiracy theorists finally have something real to obsess over?\n\nOne thing's for certain: come September 29th, we'll all be craning our necks skyward, squinting furiously at the vast nothingness above, pretending we can see our new celestial stepchild. And as it silently slips away two months later, we'll be left with nothing but memories, a slightly stiffer neck, and the vague feeling that somewhere out there, the universe is having a good laugh at our expense.\n\nSo raise a glass to 2024 PT5, our cosmic couchsurfer. May its brief stay remind us all that in the grand scheme of things, we're all just temporary residents in this vast, absurd universe. Now, if you'll excuse me, I need to go prepare for the inevitable alien invasion that this will surely provoke. I hear tinfoil hats are back in fashion.",
            "headline": "Lunar Lunacy: Earth's New Mini-Moon Sparks Interplanetary Custody Battle",
            "explanation": "The analogies used in this satirical column effectively illustrate the absurdity and humor surrounding the notion of Earth gaining a new, temporary moon. They create vivid and entertaining images that highlight the ridiculousness of the situation, making complex astronomical concepts relatable and engaging for readers. The analogies add a layer of humor and critique, particularly towards human behavior and societal norms, enhancing the overall satirical tone of the piece.",
            "analogy_1": "the Earth is actually a cosmic Pac-Man, gobbling up space rocks as it zips through the universe",
            "analogy_2": "the Moon has been seen hurling cheese at Earth and threatening to elope with Mars",
            "analogy_3": "our cosmic couchsurfer",
            "scored_analogies": [
                {
                    "id": 4,
                    "style_code": "Style 2",
                    "analogy": "the Earth is actually a cosmic Pac-Man, gobbling up space rocks as it zips through the universe",
                    "humor_score": 8,
                    "originality_score": 6,
                    "bite_score": 6,
                    "total_score": 20
                },
                {
                    "id": 5,
                    "style_code": "Style 2",
                    "analogy": "the Moon has been seen hurling cheese at Earth and threatening to elope with Mars",
                    "humor_score": 6,
                    "originality_score": 5,
                    "bite_score": 4,
                    "total_score": 15
                },
                {
                    "id": 6,
                    "style_code": "Style 2",
                    "analogy": "our cosmic couchsurfer",
                    "humor_score": 5,
                    "originality_score": 6,
                    "bite_score": 3,
                    "total_score": 14
                }
            ],
            "total_set_score": 49
        },
        {
            "style_code": "Style 3",
            "satirical_column": "In a shocking turn of events that has rocked the astronomical community and sent relationship counselors into a frenzy, our dear Mother Earth has decided to take on a second moon. Yes, you heard that right. After 4.5 billion years of monogamous bliss with her faithful lunar companion, our planet has succumbed to the cosmic equivalent of a mid-life crisis.\n\nThe home-wrecker in question? A diminutive asteroid barely the size of a New York City studio apartment, which Earth will be entertaining for a brief two-month sojourn starting this weekend. One can only imagine the awkward celestial dinner parties to come.\n\n\"It's just a phase,\" insisted Luna, Earth's long-time partner, in an exclusive interview. \"We've been through meteor showers, solar flares, and even that rough patch during the Late Heavy Bombardment. This too shall pass.\"\n\nMeanwhile, conspiracy theorists are having a field day. \"First, it was the so-called 'moon landing,'\" ranted one tin-foil hat enthusiast, \"and now they expect us to believe in a second moon? What's next? Mars adopting Phobos and Deimos from a Kuiper Belt orphanage?\"\n\nScientists, ever the party poopers, have assured us that this celestial dalliance is perfectly natural and happens more often than we realize. It's akin to Earth swiping right on Tinder and matching with a passing space rock – fleeting, inconsequential, and invisible to the naked eye.\n\nBut let's not downplay the gravity of the situation (pun absolutely intended). This cosmic affair raises some pressing questions: Will our tides become even more complicated than a Thomas Pynchon novel? Should we update our outdated lunar-based calendars to include this stellar side piece? And most importantly, will werewolves now have to howl twice as often?\n\nLocal astrologers are scrambling to adjust their horoscopes. \"This changes everything,\" exclaimed Madame Zoltara, local crystal ball enthusiast. \"Geminis might actually become tolerable for these two months!\"\n\nFor those hoping to catch a glimpse of Earth's new beau, I'm afraid you're out of luck unless you have access to the Hubble Space Telescope or a really, really good pair of binoculars. It seems our planet prefers to keep this relationship on the down-low, much like your uncle's \"roommate\" who only shows up for family gatherings on leap years.\n\nAs we brace ourselves for this cosmic ménage à trois, let us remember that in the grand scheme of things, we are but specks of dust clinging to a slightly larger speck of dust, hurtling through the vast emptiness of space. And sometimes, that slightly larger speck of dust just needs to feel young again.\n\nSo here's to you, Earth, you cosmic cougar. May your brief fling with 2024 PT5 be as thrilling as it is fleeting. And to our loyal moon, hang in there, old friend. After all, it's not the size of the celestial body that matters, but the gravitational pull it exerts on our hearts.",
            "headline": "Earth's Celestial Fling: A Cosmic Mid-Life Crisis",
            "explanation": "The analogies in this satirical column effectively convey the absurdity and humor of Earth taking on a second moon by comparing it to relatable human experiences, such as mid-life crises and dating scenarios. This strategy not only engages the reader but also adds a layer of entertainment and satire, making complex astronomical concepts more accessible and amusing.",
            "analogy_1": "It's akin to Earth swiping right on Tinder and matching with a passing space rock – fleeting, inconsequential, and invisible to the naked eye.",
            "analogy_2": "much like your uncle's 'roommate' who only shows up for family gatherings on leap years.",
            "analogy_3": "it's not the size of the celestial body that matters, but the gravitational pull it exerts on our hearts.",
            "scored_analogies": [
                {
                    "id": 7,
                    "style_code": "Style 3",
                    "analogy": "It's akin to Earth swiping right on Tinder and matching with a passing space rock – fleeting, inconsequential, and invisible to the naked eye.",
                    "humor_score": 9,
                    "originality_score": 8,
                    "bite_score": 9,
                    "total_score": 26
                },
                {
                    "id": 8,
                    "style_code": "Style 3",
                    "analogy": "much like your uncle's 'roommate' who only shows up for family gatherings on leap years.",
                    "humor_score": 7,
                    "originality_score": 7,
                    "bite_score": 6,
                    "total_score": 20
                },
                {
                    "id": 9,
                    "style_code": "Style 3",
                    "analogy": "it's not the size of the celestial body that matters, but the gravitational pull it exerts on our hearts.",
                    "humor_score": 8,
                    "originality_score": 7,
                    "bite_score": 8,
                    "total_score": 23
                }
            ],
            "total_set_score": 69,
            "labelled_analogies": [
                "It's akin to {{Earth}} swiping right on {{Tinder}} and matching with a passing {{space rock}} – fleeting, inconsequential, and invisible to the naked eye.",
                "much like your uncle's {{roommate}} who only shows up for {{leap years}}.",
                "it's not the size of the {{celestial body}} that matters, but the {{gravity}} it exerts on our hearts."
            ],
            "processed_analogies": [
                "It's akin to {1} swiping right on {2} and matching with a passing {3} – fleeting, inconsequential, and invisible to the naked eye.",
                "much like your uncle's {4} who only shows up for {5}.",
                "it's not the size of the {6} that matters, but the {7} it exerts on our hearts."
            ],
            "giveaway_keywords": [
                {
                    "id": 1,
                    "answer": "Earth"
                },
                {
                    "id": 2,
                    "answer": "Tinder"
                },
                {
                    "id": 3,
                    "answer": "space rock"
                },
                {
                    "id": 4,
                    "answer": "roommate"
                },
                {
                    "id": 5,
                    "answer": "leap years"
                },
                {
                    "id": 6,
                    "answer": "celestial body"
                },
                {
                    "id": 7,
                    "answer": "gravity"
                }
            ],
            "alternative_sets": [
                {
                    "analogy_index": 0,
                    "original_analogy": "It's akin to {1} swiping right on {2} and matching with a passing {3} – fleeting, inconsequential, and invisible to the naked eye.",
                    "alternative_sets": [
                        {
                            "analogy": "It's akin to Hamster Wheel swiping right on Yacht Club and matching with a passing Rubber Chicken – fleeting, inconsequential, and invisible to the naked eye.",
                            "alternative_words": {
                                "1": "Hamster Wheel",
                                "3": "Rubber Chicken",
                                "2": "Yacht Club"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 8,
                                "bite_score": 7
                            },
                            "total_score": 24,
                            "similarity_score": 1,
                            "adjusted_score": 23
                        },
                        {
                            "analogy": "It's akin to Rubik's Cube swiping right on Farmer's Market and matching with a passing Sock Puppet – fleeting, inconsequential, and invisible to the naked eye.",
                            "alternative_words": {
                                "1": "Rubik's Cube",
                                "3": "Sock Puppet",
                                "2": "Farmer's Market"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 22,
                            "similarity_score": 1,
                            "adjusted_score": 21
                        },
                        {
                            "analogy": "It's akin to Lasagna swiping right on Library and matching with a passing Pizza Slice – fleeting, inconsequential, and invisible to the naked eye.",
                            "alternative_words": {
                                "1": "Lasagna",
                                "3": "Pizza Slice",
                                "2": "Library"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "It's akin to Disco Ball swiping right on Dumpster Fire and matching with a passing Toothbrush – fleeting, inconsequential, and invisible to the naked eye.",
                            "alternative_words": {
                                "1": "Disco Ball",
                                "3": "Toothbrush",
                                "2": "Dumpster Fire"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 6,
                                "bite_score": 7
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "It's akin to Marshmallow swiping right on Bingo Night and matching with a passing Banana Peel – fleeting, inconsequential, and invisible to the naked eye.",
                            "alternative_words": {
                                "1": "Marshmallow",
                                "3": "Banana Peel",
                                "2": "Bingo Night"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 5
                            },
                            "total_score": 20,
                            "similarity_score": 1,
                            "adjusted_score": 19
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "It's akin to Hamster Wheel swiping right on Yacht Club and matching with a passing Rubber Chicken – fleeting, inconsequential, and invisible to the naked eye.",
                                "alternative_words": {
                                    "1": "Hamster Wheel",
                                    "3": "Rubber Chicken",
                                    "2": "Yacht Club"
                                },
                                "scores": {
                                    "originality_score": 9,
                                    "humor_score": 8,
                                    "bite_score": 7
                                },
                                "total_score": 24,
                                "similarity_score": 1,
                                "adjusted_score": 23
                            },
                            {
                                "analogy": "It's akin to Rubik's Cube swiping right on Farmer's Market and matching with a passing Sock Puppet – fleeting, inconsequential, and invisible to the naked eye.",
                                "alternative_words": {
                                    "1": "Rubik's Cube",
                                    "3": "Sock Puppet",
                                    "2": "Farmer's Market"
                                },
                                "scores": {
                                    "originality_score": 9,
                                    "humor_score": 7,
                                    "bite_score": 6
                                },
                                "total_score": 22,
                                "similarity_score": 1,
                                "adjusted_score": 21
                            }
                        ]
                    }
                },
                {
                    "analogy_index": 1,
                    "original_analogy": "much like your uncle's {4} who only shows up for {5}.",
                    "alternative_sets": [
                        {
                            "analogy": "much like your uncle's Invisible Friend who only shows up for WiFi Passwords.",
                            "alternative_words": {
                                "5": "WiFi Passwords",
                                "4": "Invisible Friend"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "much like your uncle's Vending Machine who only shows up for Tax Seasons.",
                            "alternative_words": {
                                "5": "Tax Seasons",
                                "4": "Vending Machine"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "much like your uncle's Cactus who only shows up for Pop Quizzes.",
                            "alternative_words": {
                                "5": "Pop Quizzes",
                                "4": "Cactus"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "much like your uncle's Pet Rock who only shows up for Dog Years.",
                            "alternative_words": {
                                "5": "Dog Years",
                                "4": "Pet Rock"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 6,
                                "bite_score": 5
                            },
                            "total_score": 19,
                            "similarity_score": 1,
                            "adjusted_score": 18
                        },
                        {
                            "analogy": "much like your uncle's Cardboard Cutout who only shows up for Potato Chips.",
                            "alternative_words": {
                                "5": "Potato Chips",
                                "4": "Cardboard Cutout"
                            },
                            "scores": {
                                "originality_score": 7,
                                "humor_score": 6,
                                "bite_score": 5
                            },
                            "total_score": 18,
                            "similarity_score": 1,
                            "adjusted_score": 17
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "much like your uncle's Invisible Friend who only shows up for WiFi Passwords.",
                                "alternative_words": {
                                    "5": "WiFi Passwords",
                                    "4": "Invisible Friend"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 6
                                },
                                "total_score": 21,
                                "similarity_score": 1,
                                "adjusted_score": 20
                            },
                            {
                                "analogy": "much like your uncle's Vending Machine who only shows up for Tax Seasons.",
                                "alternative_words": {
                                    "5": "Tax Seasons",
                                    "4": "Vending Machine"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 6
                                },
                                "total_score": 21,
                                "similarity_score": 1,
                                "adjusted_score": 20
                            }
                        ]
                    }
                },
                {
                    "analogy_index": 2,
                    "original_analogy": "it's not the size of the {6} that matters, but the {7} it exerts on our hearts.",
                    "alternative_sets": [
                        {
                            "analogy": "it's not the size of the Sushi Platter that matters, but the Bubble Wrap it exerts on our hearts.",
                            "alternative_words": {
                                "6": "Sushi Platter",
                                "7": "Bubble Wrap"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "it's not the size of the Soap Opera that matters, but the Tickle Monster it exerts on our hearts.",
                            "alternative_words": {
                                "6": "Soap Opera",
                                "7": "Tickle Monster"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "it's not the size of the Meme Collection that matters, but the Jazz Hands it exerts on our hearts.",
                            "alternative_words": {
                                "6": "Meme Collection",
                                "7": "Jazz Hands"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "it's not the size of the Pro Wrestling Match that matters, but the Unicorn Magic it exerts on our hearts.",
                            "alternative_words": {
                                "6": "Pro Wrestling Match",
                                "7": "Unicorn Magic"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 5
                            },
                            "total_score": 20,
                            "similarity_score": 1,
                            "adjusted_score": 19
                        },
                        {
                            "analogy": "it's not the size of the Jazz Ensemble that matters, but the Chocolate Fountain it exerts on our hearts.",
                            "alternative_words": {
                                "6": "Jazz Ensemble",
                                "7": "Chocolate Fountain"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 6,
                                "bite_score": 4
                            },
                            "total_score": 18,
                            "similarity_score": 1,
                            "adjusted_score": 17
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "it's not the size of the Sushi Platter that matters, but the Bubble Wrap it exerts on our hearts.",
                                "alternative_words": {
                                    "6": "Sushi Platter",
                                    "7": "Bubble Wrap"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 6
                                },
                                "total_score": 21,
                                "similarity_score": 1,
                                "adjusted_score": 20
                            },
                            {
                                "analogy": "it's not the size of the Soap Opera that matters, but the Tickle Monster it exerts on our hearts.",
                                "alternative_words": {
                                    "6": "Soap Opera",
                                    "7": "Tickle Monster"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 6
                                },
                                "total_score": 21,
                                "similarity_score": 1,
                                "adjusted_score": 20
                            }
                        ]
                    }
                }
            ],
            "final_alternative_keywords": [
                [
                    "Rubik's Cube",
                    "Hamster Wheel"
                ],
                [
                    "Sock Puppet",
                    "Rubber Chicken"
                ],
                [
                    "Yacht Club",
                    "Farmer's Market"
                ],
                [
                    "Tax Seasons",
                    "WiFi Passwords"
                ],
                [
                    "Invisible Friend",
                    "Vending Machine"
                ],
                [
                    "Sushi Platter",
                    "Soap Opera"
                ],
                [
                    "Bubble Wrap",
                    "Tickle Monster"
                ]
            ],
            "six_word_story": "Earth to briefly capture second mini-moon."
        }
    ]
}