{
    "results": [
        {
            "style_code": "Style 1",
            "satirical_column": "In a twist that would make Logan Roy's eyebrows twitch with envy, the Murdoch clan has descended upon Reno, Nevada, transforming the \"Biggest Little City in the World\" into a Thunderdome for billionaires. Move over, Mad Max – we've got Mad Murdochs.\n\nRupert Murdoch, the 93-year-old media mogul who makes Voldemort look like a cuddly kitten, has decided that the best place to settle his family's future is in a city famous for quickie divorces and all-you-can-eat buffets. Because nothing says \"I love you, my children\" quite like battling over a £14.9bn trust in a place where the local cuisine is primarily deep-fried regret.\n\nThe scene outside the Washoe County Courthouse resembled a funeral procession for democracy, with seven black SUVs ferrying the Murdochs to and fro. One can only assume the eighth SUV was reserved for carrying whatever remains of journalistic integrity.\n\nInside the courtroom, sealed tighter than Boris Johnson's lockdown party guest list, Rupert reportedly seeks to give greater control to his eldest son, Lachlan. It's heartwarming to see a father so dedicated to preserving his legacy of misinformation and political meddling. After all, why let pesky things like \"equal shares\" or \"sibling harmony\" get in the way of ensuring Fox News continues its stellar work as the USA's premier fiction channel?\n\nMeanwhile, James, Elisabeth, and Prudence Murdoch find themselves in the unenviable position of being the Fredo Corleones of this media mafia. One can almost hear Rupert whispering, \"I knew it was you, [insert child's name]. You broke my heart.\" The only difference is that instead of a kiss of death, they'll probably get a severance package and a lifetime subscription to The Sun.\n\nThe irony of the Murdochs fighting over a trust set up during Rupert's second divorce is thicker than the plot of a telenovela. It's as if the old man looked at his family tree and thought, \"You know what this needs? More branches to saw off.\"\n\nAs the case unfolds behind closed doors, the good people of Reno remain blissfully unaware that the future of global media is being decided between their local Denny's and the \"Biggest Little Wedding Chapel.\" It's a testament to Nevada's commitment to privacy, or perhaps just a sign that even gossip has standards.\n\nIn the end, whatever the outcome, we can be sure of one thing: the Murdoch Christmas dinner will be a frosty affair. As the family carves into their turkey, they'll also be carving up empires, reputations, and whatever remnants of familial love managed to survive this Reno reckoning.\n\nSo, as we wait with bated breath for the sealed verdict, let's raise a glass to the Murdochs – proving once again that blood may be thicker than water, but ink is thicker than both. Here's to family, fortune, and the finest feuds money can buy. Cheers, Reno – you've outdone yourself this time.",
            "headline": "Succession's Real-Life Sequel: Murdochs Turn Reno into Billionaire Thunderdome",
            "explanation": "The analogies in the column effectively juxtapose the Murdochs' familial strife and power struggles with popular cultural references, creating humor and highlighting the absurdity of their situation. By likening the family's legal battles to a Thunderdome, a dramatic and chaotic arena, the author emphasizes the fierce competition and stakes involved. Additionally, comparing Rupert Murdoch to Voldemort and the courtroom to a funeral procession for democracy adds layers of satire, making the dire situation feel both entertaining and poignant. The use of references to Mad Max and the Godfather further grounds the narrative in familiar tropes, enhancing relatability and engagement.",
            "analogy_1": "the Murdoch clan has descended upon Reno, Nevada, transforming the 'Biggest Little City in the World' into a Thunderdome for billionaires.",
            "analogy_2": "Rupert Murdoch, the 93-year-old media mogul who makes Voldemort look like a cuddly kitten",
            "analogy_3": "the scene outside the Washoe County Courthouse resembled a funeral procession for democracy",
            "scored_analogies": [
                {
                    "id": 1,
                    "style_code": "Style 1",
                    "analogy": "the Murdoch clan has descended upon Reno, Nevada, transforming the 'Biggest Little City in the World' into a Thunderdome for billionaires.",
                    "humor_score": 8,
                    "originality_score": 8,
                    "bite_score": 7,
                    "total_score": 23
                },
                {
                    "id": 2,
                    "style_code": "Style 1",
                    "analogy": "Rupert Murdoch, the 93-year-old media mogul who makes Voldemort look like a cuddly kitten.",
                    "humor_score": 9,
                    "originality_score": 7,
                    "bite_score": 8,
                    "total_score": 24
                },
                {
                    "id": 3,
                    "style_code": "Style 1",
                    "analogy": "the scene outside the Washoe County Courthouse resembled a funeral procession for democracy.",
                    "humor_score": 7,
                    "originality_score": 8,
                    "bite_score": 9,
                    "total_score": 24
                }
            ],
            "total_set_score": 71
        },
        {
            "style_code": "Style 2",
            "satirical_column": "In a twist that would make even the most ardent conspiracy theorist blush, the Murdoch family saga has taken a turn for the surreal in the neon-drenched dreamscape of Reno, Nevada. As the saying goes, \"Vegas is where you get married, Reno is where you get divorced,\" but in this case, it's where reality itself seems to have filed for separation from sanity.\n\nPicture, if you will, a courthouse that exists simultaneously in our dimension and the quantum realm, where Schrödinger's cat is both alive and dead, and Rupert Murdoch is both 93 years old and an infant suckling at the teat of conservative media. It's in this liminal space that the future of the world's most influential right-wing propaganda machine—I mean, \"news organization\"—is being decided.\n\nThe Murdoch clan, resembling a dysfunctional crossover between \"Succession\" and \"Rick and Morty,\" arrived in a seven-car convoy of black SUVs. One can only assume these vehicles run on a potent mixture of liberal tears and fossil fuels extracted from dinosaurs that died believing the Earth was flat.\n\nInside the courthouse, a scene unfolds that would make Salvador Dali reach for his melting clock in despair. Rupert Murdoch, channeling his inner Ozymandias, sits atop a throne made of forgotten newspaper subscriptions and Facebook likes. His children, each a horcrux containing a fragment of his media soul, dance the dance of succession in a rhythm only comprehensible to those who've ingested the psychoactive essence of Tucker Carlson's bow tie.\n\nLachlan Murdoch, the chosen one, stands to inherit not just a media empire, but also the sacred duty of keeping America's uncles angry at Thanksgiving dinner. His siblings—James, Elisabeth, and Prudence—circle like sharks in a sea of alternative facts, each hoping to take a bite out of the empire that once told us Obama was a secret Kenyan Muslim lizard person.\n\nBut wait! In a twist worthy of M. Night Shyamalan directing an episode of \"The Twilight Zone,\" it turns out the real power lies not with Rupert or his children, but with an irrevocable trust. This trust, birthed during Rupert's second divorce (because nothing says \"I believe in the sanctity of marriage\" quite like multiple divorces), holds the true strings of power. It's as if Rupert Murdoch's entire life has been an elaborate game of 4D chess, where the pieces are media outlets and the board is the collective consciousness of the Western world.\n\nAs the family fights behind closed doors, one can't help but wonder: Is this really about the future of a media empire, or is it an elaborate distraction from the fact that Fox News has been secretly run by a hyper-intelligent AI trained exclusively on the fever dreams of Alex Jones?\n\nMeanwhile, outside the courthouse, life in Reno continues unabated. Local residents, blissfully unaware of the cosmic drama unfolding in their midst, go about their days, pausing only to wonder why their TVs have started spontaneously tuning to Fox News and why their Alexa devices are suddenly spouting Tucker Carlson's greatest hits.\n\nAs we await the outcome of this Kafkaesque family feud, one thing is certain: Whatever emerges from that courthouse will shape the future of media, politics, and possibly the very fabric of reality itself. Or maybe it won't. In the world of Murdoch, where truth is as malleable as play-doh in the hands of a toddler on a sugar high, anything is possible.\n\nSo here's to you, Rupert Murdoch, you magnificent bastard. May your empire continue to blur the lines between news and fiction, reality and fantasy, sanity and madness. And may we all find the remote control before it's too late.",
            "headline": "Murdoch's Metaverse Madness: When Fox News Meets the Quantum Realm",
            "explanation": "The analogies used in this satirical column effectively highlight the surreal and chaotic nature of the Murdoch family's media empire and the state of contemporary news. They do so by comparing real-life situations to absurd or fantastical elements, making the commentary both entertaining and thought-provoking. The analogies are rich in cultural references and imaginative comparisons, enhancing the overall satire by illustrating the bizarre intersection of media, politics, and family dynamics. Each analogy adds a layer of humor and critique, inviting readers to reflect on the implications of Murdoch's influence in a way that is both engaging and accessible.",
            "analogy_1": "It's in this liminal space that the future of the world's most influential right-wing propaganda machine—I mean, \"news organization\"—is being decided.",
            "analogy_2": "Rupert Murdoch, channeling his inner Ozymandias, sits atop a throne made of forgotten newspaper subscriptions and Facebook likes.",
            "analogy_3": "It's as if Rupert Murdoch's entire life has been an elaborate game of 4D chess, where the pieces are media outlets and the board is the collective consciousness of the Western world.",
            "scored_analogies": [
                {
                    "id": 4,
                    "style_code": "Style 2",
                    "analogy": "It's in this liminal space that the future of the world's most influential right-wing propaganda machine—I mean, 'news organization'—is being decided.",
                    "humor_score": 8,
                    "originality_score": 8,
                    "bite_score": 8,
                    "total_score": 24
                },
                {
                    "id": 5,
                    "style_code": "Style 2",
                    "analogy": "Rupert Murdoch, channeling his inner Ozymandias, sits atop a throne made of forgotten newspaper subscriptions and Facebook likes.",
                    "humor_score": 8,
                    "originality_score": 9,
                    "bite_score": 8,
                    "total_score": 25
                },
                {
                    "id": 6,
                    "style_code": "Style 2",
                    "analogy": "It's as if Rupert Murdoch's entire life has been an elaborate game of 4D chess, where the pieces are media outlets and the board is the collective consciousness of the Western world.",
                    "humor_score": 7,
                    "originality_score": 9,
                    "bite_score": 7,
                    "total_score": 23
                }
            ],
            "total_set_score": 72
        },
        {
            "style_code": "Style 3",
            "satirical_column": "In the neon-lit purgatory of Reno, Nevada, where slot machines chime the rhythm of shattered dreams and all-you-can-eat buffets serve as last suppers for doomed marriages, an altogether different sort of familial implosion is taking place. The Murdoch clan, those puppeteers of public opinion and architects of reality TV presidencies, have descended upon \"The Biggest Little City in the World\" like a flock of well-coiffed vultures circling the still-twitching carcass of their patriarch's media empire.\n\nPicture, if you will, a convoy of black SUVs snaking through the desert, each vehicle packed tighter than a News of the World editor's conscience. Inside, the Murdoch children bicker over who gets to inherit daddy's favorite propaganda machine, while 93-year-old Rupert sits in the lead car, chuckling to himself as he edits tomorrow's headlines: \"Succession Battle Tears Family Apart, Ratings Soar!\"\n\nAs the family filed into the Washoe County Courthouse, locals barely batted an eye. After all, in a town where you can legally marry a slot machine (I'm only slightly exaggerating), a media mogul trying to rewrite his will is about as noteworthy as a Wayne Newton comeback tour.\n\nBut oh, the delicious irony! The family that built an empire on exposing others' dirty laundry now finds itself desperately trying to keep its own skidmarks out of the public eye. It's like watching Lady Macbeth frantically scrubbing her hands while hosting a hand sanitizer infomercial.\n\nOne can only imagine the scene inside the courtroom. Lachlan, the golden child, probably sat smugly in his chair, mentally redecorating the Fox News offices with more red, white, and blue. James, the prodigal son, likely doodled plans for a new streaming service called \"Woke+\". Elisabeth, ever the dark horse, was no doubt pitching a reality show concept: \"Keeping Up With The Murdochs: Reno Edition\". And Prudence? Well, she was just happy to be included.\n\nMeanwhile, in a tea shop around the corner, life went on as usual. Two students, blissfully unaware of the seismic shifts in media power occurring mere feet away, debated whether to get oat milk or almond milk in their chai lattes. It's a scene straight out of a Coen brothers film – the absurd juxtaposition of the mundane and the monumental.\n\nAs the trial wrapped up, the Murdochs slipped away into the night, leaving behind nothing but tire tracks and a faint whiff of Aussie-scented ambition. The outcome of their secret battle remains unknown, sealed away like the lost ark in some dusty Nevada filing cabinet.\n\nBut fear not, dear readers! For even as the Murdochs fight over the remote control to our collective consciousness, we can take solace in the fact that in Reno, as in life, the house always wins. And in this case, the house is a garish, neon-lit temple to capitalism, where dreams go to die and family empires crumble faster than a sandcastle in a tsunami.\n\nSo the next time you flip through channels and land on a particularly incendiary piece of \"news\", remember the great Reno Murdoch caper of 2024. Somewhere, in a dimly lit hotel room, Rupert is cackling into his prune juice, secure in the knowledge that no matter who inherits his empire, chaos will continue to reign supreme. And isn't that what family is all about?",
            "headline": "Reno 911: Murdoch's Last Stand in the Biggest Little Succession Battle",
            "explanation": "The analogies in this satirical column effectively encapsulate the absurdity and drama of the Murdoch family's internal power struggle while simultaneously commenting on the media landscape. They blend humor with sharp social commentary, highlighting the contrasts between high-stakes familial conflicts and the mundane realities of everyday life. Each analogy serves to amplify the article's satirical tone, making complex themes accessible and entertaining.",
            "analogy_1": "It's like watching Lady Macbeth frantically scrubbing her hands while hosting a hand sanitizer infomercial.",
            "analogy_2": "A scene straight out of a Coen brothers film – the absurd juxtaposition of the mundane and the monumental.",
            "analogy_3": "The house always wins. And in this case, the house is a garish, neon-lit temple to capitalism, where dreams go to die and family empires crumble faster than a sandcastle in a tsunami.",
            "scored_analogies": [
                {
                    "id": 7,
                    "style_code": "Style 3",
                    "analogy": "It's like watching Lady Macbeth frantically scrubbing her hands while hosting a hand sanitizer infomercial.",
                    "humor_score": 9,
                    "originality_score": 8,
                    "bite_score": 9,
                    "total_score": 26
                },
                {
                    "id": 8,
                    "style_code": "Style 3",
                    "analogy": "A scene straight out of a Coen brothers film – the absurd juxtaposition of the mundane and the monumental.",
                    "humor_score": 8,
                    "originality_score": 7,
                    "bite_score": 8,
                    "total_score": 23
                },
                {
                    "id": 9,
                    "style_code": "Style 3",
                    "analogy": "The house always wins. And in this case, the house is a garish, neon-lit temple to capitalism, where dreams go to die and family empires crumble faster than a sandcastle in a tsunami.",
                    "humor_score": 9,
                    "originality_score": 8,
                    "bite_score": 9,
                    "total_score": 26
                }
            ],
            "total_set_score": 75,
            "labelled_analogies": [
                "It's like watching {{Lady Macbeth}} frantically scrubbing her hands while hosting {{a hand sanitizer infomercial}}.",
                "A scene straight out of {{a Coen brothers film}} – the absurd juxtaposition of the mundane and the monumental.",
                "The house always wins. And in this case, the house is a garish, neon-lit temple to {{capitalism}}, where dreams go to die and family empires crumble faster than {{a sandcastle in a tsunami}}."
            ],
            "processed_analogies": [
                "It's like watching {1} frantically scrubbing her hands while hosting {2}.",
                "A scene straight out of {3} – the absurd juxtaposition of the mundane and the monumental.",
                "The house always wins. And in this case, the house is a garish, neon-lit temple to {4}, where dreams go to die and family empires crumble faster than {5}."
            ],
            "giveaway_keywords": [
                {
                    "id": 1,
                    "answer": "Lady Macbeth"
                },
                {
                    "id": 2,
                    "answer": "a hand sanitizer infomercial"
                },
                {
                    "id": 3,
                    "answer": "a Coen brothers film"
                },
                {
                    "id": 4,
                    "answer": "capitalism"
                },
                {
                    "id": 5,
                    "answer": "a sandcastle in a tsunami"
                }
            ],
            "alternative_sets": [
                {
                    "analogy_index": 0,
                    "original_analogy": "It's like watching {1} frantically scrubbing her hands while hosting {2}.",
                    "alternative_sets": [
                        {
                            "analogy": "It's like watching a reality TV show villain frantically scrubbing her hands while hosting a motivational speaker at a pyramid scheme.",
                            "alternative_words": {
                                "2": "a motivational speaker at a pyramid scheme",
                                "1": "a reality TV show villain"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 1,
                            "adjusted_score": 23
                        },
                        {
                            "analogy": "It's like watching a kindergarten teacher on candy duty frantically scrubbing her hands while hosting an overly enthusiastic weather forecast.",
                            "alternative_words": {
                                "2": "an overly enthusiastic weather forecast",
                                "1": "a kindergarten teacher on candy duty"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 22,
                            "similarity_score": 1,
                            "adjusted_score": 21
                        },
                        {
                            "analogy": "It's like watching a drill sergeant on laundry day frantically scrubbing her hands while hosting a used car sales pitch.",
                            "alternative_words": {
                                "2": "a used car sales pitch",
                                "1": "a drill sergeant on laundry day"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "It's like watching a cat plotting world domination frantically scrubbing her hands while hosting a late-night energy drink ad.",
                            "alternative_words": {
                                "2": "a late-night energy drink ad",
                                "1": "a cat plotting world domination"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "It's like watching a CEO during budget cuts frantically scrubbing her hands while hosting a get-rich-quick scheme.",
                            "alternative_words": {
                                "2": "a get-rich-quick scheme",
                                "1": "a CEO during budget cuts"
                            },
                            "scores": {
                                "originality_score": 7,
                                "humor_score": 6,
                                "bite_score": 8
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "It's like watching a reality TV show villain frantically scrubbing her hands while hosting a motivational speaker at a pyramid scheme.",
                                "alternative_words": {
                                    "2": "a motivational speaker at a pyramid scheme",
                                    "1": "a reality TV show villain"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 9
                                },
                                "total_score": 24,
                                "similarity_score": 1,
                                "adjusted_score": 23
                            },
                            {
                                "analogy": "It's like watching a kindergarten teacher on candy duty frantically scrubbing her hands while hosting an overly enthusiastic weather forecast.",
                                "alternative_words": {
                                    "2": "an overly enthusiastic weather forecast",
                                    "1": "a kindergarten teacher on candy duty"
                                },
                                "scores": {
                                    "originality_score": 9,
                                    "humor_score": 7,
                                    "bite_score": 6
                                },
                                "total_score": 22,
                                "similarity_score": 1,
                                "adjusted_score": 21
                            }
                        ]
                    }
                },
                {
                    "analogy_index": 1,
                    "original_analogy": "A scene straight out of {3} – the absurd juxtaposition of the mundane and the monumental.",
                    "alternative_sets": [
                        {
                            "analogy": "A scene straight out of a Wes Anderson diorama – the absurd juxtaposition of the mundane and the monumental.",
                            "alternative_words": {
                                "3": "a Wes Anderson diorama"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 6,
                                "bite_score": 7
                            },
                            "total_score": 21,
                            "similarity_score": 2,
                            "adjusted_score": 19
                        },
                        {
                            "analogy": "A scene straight out of a Quentin Tarantino standoff – the absurd juxtaposition of the mundane and the monumental.",
                            "alternative_words": {
                                "3": "a Quentin Tarantino standoff"
                            },
                            "scores": {
                                "originality_score": 7,
                                "humor_score": 6,
                                "bite_score": 8
                            },
                            "total_score": 21,
                            "similarity_score": 2,
                            "adjusted_score": 19
                        },
                        {
                            "analogy": "A scene straight out of a Michael Bay explosion fest – the absurd juxtaposition of the mundane and the monumental.",
                            "alternative_words": {
                                "3": "a Michael Bay explosion fest"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 2,
                            "adjusted_score": 19
                        },
                        {
                            "analogy": "A scene straight out of a Christopher Nolan paradox – the absurd juxtaposition of the mundane and the monumental.",
                            "alternative_words": {
                                "3": "a Christopher Nolan paradox"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 5,
                                "bite_score": 7
                            },
                            "total_score": 20,
                            "similarity_score": 2,
                            "adjusted_score": 18
                        },
                        {
                            "analogy": "A scene straight out of a Tim Burton fever dream – the absurd juxtaposition of the mundane and the monumental.",
                            "alternative_words": {
                                "3": "a Tim Burton fever dream"
                            },
                            "scores": {
                                "originality_score": 7,
                                "humor_score": 5,
                                "bite_score": 6
                            },
                            "total_score": 18,
                            "similarity_score": 2,
                            "adjusted_score": 16
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "A scene straight out of a Wes Anderson diorama – the absurd juxtaposition of the mundane and the monumental.",
                                "alternative_words": {
                                    "3": "a Wes Anderson diorama"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 6,
                                    "bite_score": 7
                                },
                                "total_score": 21,
                                "similarity_score": 2,
                                "adjusted_score": 19
                            },
                            {
                                "analogy": "A scene straight out of a Quentin Tarantino standoff – the absurd juxtaposition of the mundane and the monumental.",
                                "alternative_words": {
                                    "3": "a Quentin Tarantino standoff"
                                },
                                "scores": {
                                    "originality_score": 7,
                                    "humor_score": 6,
                                    "bite_score": 8
                                },
                                "total_score": 21,
                                "similarity_score": 2,
                                "adjusted_score": 19
                            }
                        ]
                    }
                },
                {
                    "analogy_index": 2,
                    "original_analogy": "The house always wins. And in this case, the house is a garish, neon-lit temple to {4}, where dreams go to die and family empires crumble faster than {5}.",
                    "alternative_sets": [
                        {
                            "analogy": "The house always wins. And in this case, the house is a garish, neon-lit temple to a Black Friday shopping spree, where dreams go to die and family empires crumble faster than a popsicle in the Sahara.",
                            "alternative_words": {
                                "5": "a popsicle in the Sahara",
                                "4": "a Black Friday shopping spree"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 8,
                                "bite_score": 8
                            },
                            "total_score": 25,
                            "similarity_score": 3,
                            "adjusted_score": 22
                        },
                        {
                            "analogy": "The house always wins. And in this case, the house is a garish, neon-lit temple to a never-ending game of Monopoly, where dreams go to die and family empires crumble faster than a snowman in a heatwave.",
                            "alternative_words": {
                                "5": "a snowman in a heatwave",
                                "4": "a never-ending game of Monopoly"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 3,
                            "adjusted_score": 21
                        },
                        {
                            "analogy": "The house always wins. And in this case, the house is a garish, neon-lit temple to a hamster wheel made of gold, where dreams go to die and family empires crumble faster than a paper boat in a hurricane.",
                            "alternative_words": {
                                "5": "a paper boat in a hurricane",
                                "4": "a hamster wheel made of gold"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 7,
                                "bite_score": 8
                            },
                            "total_score": 24,
                            "similarity_score": 3,
                            "adjusted_score": 21
                        },
                        {
                            "analogy": "The house always wins. And in this case, the house is a garish, neon-lit temple to a reality TV competition show, where dreams go to die and family empires crumble faster than a kite in a tornado.",
                            "alternative_words": {
                                "5": "a kite in a tornado",
                                "4": "a reality TV competition show"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 3,
                            "adjusted_score": 21
                        },
                        {
                            "analogy": "The house always wins. And in this case, the house is a garish, neon-lit temple to an auction for invisible art, where dreams go to die and family empires crumble faster than a paper umbrella in a thunderstorm.",
                            "alternative_words": {
                                "5": "a paper umbrella in a thunderstorm",
                                "4": "an auction for invisible art"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 7,
                                "bite_score": 8
                            },
                            "total_score": 24,
                            "similarity_score": 3,
                            "adjusted_score": 21
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "The house always wins. And in this case, the house is a garish, neon-lit temple to a Black Friday shopping spree, where dreams go to die and family empires crumble faster than a popsicle in the Sahara.",
                                "alternative_words": {
                                    "5": "a popsicle in the Sahara",
                                    "4": "a Black Friday shopping spree"
                                },
                                "scores": {
                                    "originality_score": 9,
                                    "humor_score": 8,
                                    "bite_score": 8
                                },
                                "total_score": 25,
                                "similarity_score": 3,
                                "adjusted_score": 22
                            },
                            {
                                "analogy": "The house always wins. And in this case, the house is a garish, neon-lit temple to a never-ending game of Monopoly, where dreams go to die and family empires crumble faster than a snowman in a heatwave.",
                                "alternative_words": {
                                    "5": "a snowman in a heatwave",
                                    "4": "a never-ending game of Monopoly"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 9
                                },
                                "total_score": 24,
                                "similarity_score": 3,
                                "adjusted_score": 21
                            }
                        ]
                    }
                }
            ],
            "final_alternative_keywords": [
                [
                    "a motivational speaker at a pyramid scheme",
                    "an overly enthusiastic weather forecast"
                ],
                [
                    "a reality TV show villain",
                    "a kindergarten teacher on candy duty"
                ],
                [
                    "a Quentin Tarantino standoff",
                    "a Wes Anderson diorama"
                ],
                [
                    "a popsicle in the Sahara",
                    "a snowman in a heatwave"
                ],
                [
                    "a never-ending game of Monopoly",
                    "a Black Friday shopping spree"
                ]
            ],
            "six_word_story": "Murdoch family secretly battles for empire."
        }
    ]
}