{
    "results": [
        {
            "style_code": "Style 1",
            "satirical_column": "As Prince Harry hits the big 4-0, one can't help but marvel at the quantum leap his life has taken. From the hallowed halls of Clarence House to the sun-drenched pavements of Montecito, our ginger prince has traded his royal robes for a Netflix subscription and a lifetime supply of avocado toast.\n\nTen years ago, young Harry was serenaded by Ellie Goulding at his 30th birthday bash. Now, he's more likely to be lulled to sleep by the gentle hum of Gwyneth Paltrow's vagina-scented candles wafting over the fence. How the mighty have fallen – or risen, depending on your stance on overpriced wellness products.\n\nThe \"Sandringham summit\" – which sounds more like a disappointing flavour of Ben & Jerry's ice cream than a royal meeting – saw Harry and Meghan given the ultimate Sophie's choice: in or out. They chose \"out\" faster than Prince Andrew deletes his browsing history.\n\nNow ensconced in their £11m mansion, Harry spends his days cycling with Archie, walking dogs, and desperately trying to remember which one of his new celebrity friends is which. \"Was it Orlando who lent us his house, or was that Tyler? And which one is married to Katy Perry again?\" One imagines him muttering as he scroll through his star-studded contacts.\n\nThe prince who once partied in Vegas is now more likely to be found at a vegan juice bar, discussing the finer points of biodynamic farming with Oprah. It's a far cry from his days of Army service and royal duties. Now, his biggest battle is trying to get his father to answer the phone – a task that seems more challenging than breaching the walls of Helm's Deep.\n\nSpeaking of battles, Harry's legal crusade against the British media continues unabated. One pictures him, red-faced and wild-eyed, shouting \"You shall not pass!\" at a stack of tabloids, his Netflix documentary playing softly in the background.\n\nAs for his relationship with William, it's colder than a polar bear's toenails. The brothers, once thick as thieves, now communicate primarily through icy glares at family funerals. It's like watching the world's most depressing game of royal charades.\n\nBut fear not for our California prince! He's \"excited about 40\" and ready to \"continue showing up and doing good in the world.\" One can only assume this means more heartfelt interviews, more ghost-written memoirs, and perhaps a line of organic, fair-trade polo mallets.\n\nAs Harry blows out his forty candles (made from sustainable beeswax, naturally), one can't help but wonder: will he wish for reconciliation with his family, or just for Meghan's jam to finally set? Only time will tell. \n\nIn the meantime, let's raise a glass of kombucha to the artist formerly known as Prince Harry. May your next decade be filled with fewer lawsuits, more phone calls from Dad, and just enough royal drama to keep that Netflix deal ticking over. Happy birthday, you magnificent, exiled ginger. Long may you reign – over Montecito.",
            "headline": "Prince Harry at 40: From Royal Spare to California's Crowned Jester",
            "explanation": "The analogies in this satirical column effectively capture the dramatic contrast between Prince Harry's past royal life and his current celebrity existence in California. They use humor and cultural references to highlight the absurdities of his situation, engaging the reader while providing commentary on societal norms and expectations. The analogies convey both a sense of nostalgia for his royal duties and a tongue-in-cheek critique of his current lifestyle, making them entertaining and relatable.",
            "analogy_1": "the 'Sandringham summit' – which sounds more like a disappointing flavour of Ben & Jerry's ice cream than a royal meeting",
            "analogy_2": "his biggest battle is trying to get his father to answer the phone – a task that seems more challenging than breaching the walls of Helm's Deep",
            "analogy_3": "It's colder than a polar bear's toenails",
            "scored_analogies": [
                {
                    "id": 1,
                    "style_code": "Style 1",
                    "analogy": "the 'Sandringham summit' – which sounds more like a disappointing flavour of Ben & Jerry's ice cream than a royal meeting",
                    "humor_score": 8,
                    "originality_score": 8,
                    "bite_score": 7,
                    "total_score": 23
                },
                {
                    "id": 2,
                    "style_code": "Style 1",
                    "analogy": "his biggest battle is trying to get his father to answer the phone – a task that seems more challenging than breaching the walls of Helm's Deep",
                    "humor_score": 9,
                    "originality_score": 7,
                    "bite_score": 8,
                    "total_score": 24
                },
                {
                    "id": 3,
                    "style_code": "Style 1",
                    "analogy": "It's colder than a polar bear's toenails",
                    "humor_score": 6,
                    "originality_score": 5,
                    "bite_score": 4,
                    "total_score": 15
                }
            ],
            "total_set_score": 62
        },
        {
            "style_code": "Style 2",
            "satirical_column": "In a twist that would make even the most ardent monarchist choke on their Earl Grey, Prince Harry - once the roguish royal spare - has transcended his blue-blooded beginnings to become California's crown prince of kombucha. As he pirouettes into his forties with the grace of a polo pony on roller skates, one can't help but marvel at the quantum leap from Buckingham to Birkenstocks.\n\nGone are the days when young Harry frolicked in the hallowed halls of Clarence House, serenaded by the ethereal warbles of Ellie Goulding. Now, ensconced in his Montecito mansion - a veritable avocado-hued Versailles - he finds himself rubbing elbows with the crème de la crème of Tinseltown's glitterati. One imagines him engaged in profound tête-à-têtes with Gwyneth Paltrow, debating the merits of cbd-infused polo mallets and goop-approved horse liniment.\n\nBut fear not, for our intrepid prince hasn't completely abandoned his roots. Sources close to the Duke of Sussex whisper that he's taken to wearing a crown fashioned from kale leaves, a sartorial choice that would surely have the late Queen Mother turning in her gin-soaked grave. And let us not forget the royal corgis, replaced by a pack of rescue chihuahuas sporting miniature replica Red Coats and bearskin hats.\n\nAs Harry embarks on his fifth decade, one can't help but ponder the Shakespearean tragedy of it all. The prodigal son, cast adrift on a sea of green juice and mindfulness apps, forever seeking that elusive \"half-in, half-out\" royal role. Perhaps he'll find it in his new vocation as the self-appointed Duke of Digital Detox, leading meditation retreats for stressed-out Silicon Valley moguls in the grounds of his faux-Tudor mansion.\n\nMeanwhile, back in Blighty, the winds of change howl through the corridors of Kensington Palace. William, the heir apparent, is said to be considering a radical rebranding of the monarchy. Sources claim he's mulling over the idea of replacing the traditional Changing of the Guard with a more relatable \"Changing of the Instagram Story.\" One can only imagine Her Late Majesty's reaction to such modernization - no doubt a stern \"We are not amused\" delivered via hologram.\n\nAs for Charles, the newly minted King finds himself in a quandary. How does one mend fences with a son who's traded his royal standard for a \"Coexist\" bumper sticker? Perhaps a peace offering of organic, hand-reared swan served on a bed of quinoa might bridge the 5,000-mile gap. Or maybe a heartfelt FaceTime call, provided someone can explain to His Majesty which end of the iPhone to speak into.\n\nIn the end, as Harry blows out the candles on his gluten-free, dairy-free, joy-free birthday cake, we're left to contemplate the curious case of the prince who swapped his silver spoon for a bamboo fork. Will he find contentment in the land of perpetual sunshine and botox? Or will the siren call of beef Wellington and warm beer eventually lure him back to his rain-soaked homeland?\n\nOne thing's for certain: as Harry enters his fifth decade, he's no longer just the spare to the heir. He's become a peculiar hybrid - part exiled royal, part Hollywood curiosity, and wholly committed to \"doing good\" while looking fabulous in athleisure wear. So raise a glass of kale smoothie to Prince Harry, the man who proved that you can take the boy out of Britain, but you can't take the Britain out of the boy - no matter how many green juices you pour down his throat.",
            "headline": "Prince Harry at 40: From Royal Spare to Avocado Toast Heir",
            "explanation": "The analogies in this satirical column effectively highlight the contrast between Prince Harry's royal past and his current lifestyle in California. They paint a vivid picture of his transformation while infusing humor and cultural references that resonate with contemporary audiences. By using exaggerated and unexpected comparisons, the author creates a playful tone that underscores the absurdity of the situations described.",
            "analogy_1": "prince of kombucha",
            "analogy_2": "grace of a polo pony on roller skates",
            "analogy_3": "crown fashioned from kale leaves",
            "scored_analogies": [
                {
                    "id": 4,
                    "style_code": "Style 2",
                    "analogy": "prince of kombucha",
                    "humor_score": 7,
                    "originality_score": 9,
                    "bite_score": 6,
                    "total_score": 22
                },
                {
                    "id": 5,
                    "style_code": "Style 2",
                    "analogy": "grace of a polo pony on roller skates",
                    "humor_score": 8,
                    "originality_score": 8,
                    "bite_score": 7,
                    "total_score": 23
                },
                {
                    "id": 6,
                    "style_code": "Style 2",
                    "analogy": "crown fashioned from kale leaves",
                    "humor_score": 7,
                    "originality_score": 8,
                    "bite_score": 5,
                    "total_score": 20
                }
            ],
            "total_set_score": 65
        },
        {
            "style_code": "Style 3",
            "satirical_column": "As Prince Harry, the Duke of Sussex and Lord of the Land of Green Juice, approaches the big 4-0, one can't help but marvel at the transformation of this once-royal rapscallion into Montecito's very own King of First World Problems.\n\nGone are the days of Nazi costumes and Las Vegas strip poker; our dear Harry has traded in his crown jewels for a Netflix deal and a spot on Gwyneth Paltrow's speed dial. It's a tale as old as time, or at least as old as \"The Fresh Prince of Bel-Air\" – a scrappy lad from a broken home in England, seeking refuge in the sun-soaked paradise of California. Will Smith would be proud, if he weren't too busy slapping sense into the Academy.\n\nBut fear not, for Harry's life is not all avocado toast and chakra alignments. No, dear readers, our intrepid ex-pat faces daily battles that would make his ancestor Henry V weep into his tin of Ye Olde White Claw. Picture, if you will, the harrowing scene as Harry navigates the treacherous waters of the Whole Foods parking lot, desperately seeking a spot for his environmentally-conscious yet paradoxically enormous SUV. 'Tis a quest worthy of Arthurian legend, no doubt.\n\nAnd let us not forget the Sisyphean task of maintaining relevance in a world where being sixth in line to the British throne carries about as much weight as a participation trophy in a toddler's tee-ball league. One imagines Harry, sprawled across his ethically-sourced fainting couch, phone in hand, thumb hovering anxiously over Oprah's contact info. \"To dish or not to dish,\" he mumbles, \"that is the question.\"\n\nBut lo! What light through yonder window breaks? 'Tis the East, and Meghan is the sun – rising at 5 AM for her daily routine of journaling, manifesting, and planning world domination via Instagram. Harry, ever the supportive spouse, dutifully plays his part as Instagram Husband, angling the ring light just so to capture his beloved's best side as she records yet another podcast about the struggles of being unfathomably wealthy and inexplicably aggrieved.\n\nAs Harry blows out the organic, gluten-free candles on his farm-to-table birthday cake, one can't help but wonder: what does the future hold for our favorite ginger expat? Will he finally achieve his lifelong dream of becoming a real boy, free from the strings of monarchy? Or will he succumb to the siren song of Royal duties, lured back by the promise of ribbon-cutting ceremonies and lukewarm tea with distant cousins?\n\nOnly time will tell, dear readers. But one thing is certain – whether he's hunting for paparazzi with his neighbor Orlando Bloom or penning yet another memoir (working title: \"Even Sparer: Harry's Revenge\"), our boy from Buckingham has certainly come a long way from his days of polo and public gaffes.\n\nSo here's to you, Prince Harry, on your 40th trip around the sun. May your avocados always be ripe, your therapy sessions always enlightening, and your Netflix specials always... well, special. And remember, in the immortal words of your namesake Shakespeare (or was it Meghan's ghostwriter?): \"To thine own self be true, but also to thine multi-million dollar brand deals.\"\n\nCheerio, and pass the kombucha!",
            "headline": "Prince Harry at 40: From Royal Spare to Montecito's Millennial Monarch",
            "explanation": "The analogies in the column effectively highlight the absurdity and humor surrounding Prince Harry's transition from royal duties to a celebrity lifestyle. They draw comparisons to well-known cultural references and historical figures, enhancing the satire while making the piece relatable and entertaining. The analogies also serve to exaggerate Harry's experiences in a comedic fashion, emphasizing the contrast between his past and present.",
            "analogy_1": "a tale as old as time, or at least as old as 'The Fresh Prince of Bel-Air'",
            "analogy_2": "the harrowing scene as Harry navigates the treacherous waters of the Whole Foods parking lot",
            "analogy_3": "the Sisyphean task of maintaining relevance in a world where being sixth in line to the British throne carries about as much weight as a participation trophy in a toddler's tee-ball league",
            "scored_analogies": [
                {
                    "id": 7,
                    "style_code": "Style 3",
                    "analogy": "a tale as old as time, or at least as old as 'The Fresh Prince of Bel-Air'",
                    "humor_score": 8,
                    "originality_score": 6,
                    "bite_score": 5,
                    "total_score": 19
                },
                {
                    "id": 8,
                    "style_code": "Style 3",
                    "analogy": "the harrowing scene as Harry navigates the treacherous waters of the Whole Foods parking lot",
                    "humor_score": 9,
                    "originality_score": 8,
                    "bite_score": 9,
                    "total_score": 26
                },
                {
                    "id": 9,
                    "style_code": "Style 3",
                    "analogy": "the Sisyphean task of maintaining relevance in a world where being sixth in line to the British throne carries about as much weight as a participation trophy in a toddler's tee-ball league",
                    "humor_score": 10,
                    "originality_score": 10,
                    "bite_score": 10,
                    "total_score": 30
                }
            ],
            "total_set_score": 75,
            "labelled_analogies": [
                "a tale as old as time, or at least as old as '{{The Fresh Prince of Bel-Air}}'",
                "the harrowing scene as {{Harry}} navigates the treacherous waters of the Whole Foods parking lot",
                "the Sisyphean task of maintaining relevance in a world where being {{sixth in line}} to the {{British throne}} carries about as much weight as a participation trophy in a toddler's tee-ball league"
            ],
            "processed_analogies": [
                "a tale as old as time, or at least as old as '{1}'",
                "the harrowing scene as {2} navigates the treacherous waters of the Whole Foods parking lot",
                "the Sisyphean task of maintaining relevance in a world where being {3} to the {4} carries about as much weight as a participation trophy in a toddler's tee-ball league"
            ],
            "giveaway_keywords": [
                {
                    "id": 1,
                    "answer": "The Fresh Prince of Bel-Air"
                },
                {
                    "id": 2,
                    "answer": "Harry"
                },
                {
                    "id": 3,
                    "answer": "sixth in line"
                },
                {
                    "id": 4,
                    "answer": "British throne"
                }
            ],
            "alternative_sets": [
                {
                    "analogy_index": 0,
                    "original_analogy": "a tale as old as time, or at least as old as '{1}'",
                    "alternative_sets": [
                        {
                            "analogy": "a tale as old as time, or at least as old as 'The Hipster Duke of Trendytown'",
                            "alternative_words": {
                                "1": "The Hipster Duke of Trendytown"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 2,
                            "adjusted_score": 19
                        },
                        {
                            "analogy": "a tale as old as time, or at least as old as 'The Burger King of Fast-Food Kingdom'",
                            "alternative_words": {
                                "1": "The Burger King of Fast-Food Kingdom"
                            },
                            "scores": {
                                "originality_score": 7,
                                "humor_score": 6,
                                "bite_score": 5
                            },
                            "total_score": 18,
                            "similarity_score": 2,
                            "adjusted_score": 16
                        },
                        {
                            "analogy": "a tale as old as time, or at least as old as 'The Barista King of Coffee Land'",
                            "alternative_words": {
                                "1": "The Barista King of Coffee Land"
                            },
                            "scores": {
                                "originality_score": 7,
                                "humor_score": 6,
                                "bite_score": 5
                            },
                            "total_score": 18,
                            "similarity_score": 2,
                            "adjusted_score": 16
                        },
                        {
                            "analogy": "a tale as old as time, or at least as old as 'The Meme Lord of Internetville'",
                            "alternative_words": {
                                "1": "The Meme Lord of Internetville"
                            },
                            "scores": {
                                "originality_score": 7,
                                "humor_score": 6,
                                "bite_score": 5
                            },
                            "total_score": 18,
                            "similarity_score": 2,
                            "adjusted_score": 16
                        },
                        {
                            "analogy": "a tale as old as time, or at least as old as 'The Fitness Guru of Gym Nation'",
                            "alternative_words": {
                                "1": "The Fitness Guru of Gym Nation"
                            },
                            "scores": {
                                "originality_score": 7,
                                "humor_score": 6,
                                "bite_score": 5
                            },
                            "total_score": 18,
                            "similarity_score": 2,
                            "adjusted_score": 16
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "a tale as old as time, or at least as old as 'The Hipster Duke of Trendytown'",
                                "alternative_words": {
                                    "1": "The Hipster Duke of Trendytown"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 6
                                },
                                "total_score": 21,
                                "similarity_score": 2,
                                "adjusted_score": 19
                            },
                            {
                                "analogy": "a tale as old as time, or at least as old as 'The Burger King of Fast-Food Kingdom'",
                                "alternative_words": {
                                    "1": "The Burger King of Fast-Food Kingdom"
                                },
                                "scores": {
                                    "originality_score": 7,
                                    "humor_score": 6,
                                    "bite_score": 5
                                },
                                "total_score": 18,
                                "similarity_score": 2,
                                "adjusted_score": 16
                            }
                        ]
                    }
                },
                {
                    "analogy_index": 1,
                    "original_analogy": "the harrowing scene as {2} navigates the treacherous waters of the Whole Foods parking lot",
                    "alternative_sets": [
                        {
                            "analogy": "the harrowing scene as Larry navigates the treacherous waters of the Whole Foods parking lot",
                            "alternative_words": {
                                "2": "Larry"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 3,
                            "adjusted_score": 18
                        },
                        {
                            "analogy": "the harrowing scene as Barry navigates the treacherous waters of the Whole Foods parking lot",
                            "alternative_words": {
                                "2": "Barry"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 3,
                            "adjusted_score": 18
                        },
                        {
                            "analogy": "the harrowing scene as Jerry navigates the treacherous waters of the Whole Foods parking lot",
                            "alternative_words": {
                                "2": "Jerry"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 3,
                            "adjusted_score": 18
                        },
                        {
                            "analogy": "the harrowing scene as Gary navigates the treacherous waters of the Whole Foods parking lot",
                            "alternative_words": {
                                "2": "Gary"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 3,
                            "adjusted_score": 18
                        },
                        {
                            "analogy": "the harrowing scene as Terry navigates the treacherous waters of the Whole Foods parking lot",
                            "alternative_words": {
                                "2": "Terry"
                            },
                            "scores": {
                                "originality_score": 7,
                                "humor_score": 6,
                                "bite_score": 5
                            },
                            "total_score": 18,
                            "similarity_score": 3,
                            "adjusted_score": 15
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "the harrowing scene as Larry navigates the treacherous waters of the Whole Foods parking lot",
                                "alternative_words": {
                                    "2": "Larry"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 6
                                },
                                "total_score": 21,
                                "similarity_score": 3,
                                "adjusted_score": 18
                            },
                            {
                                "analogy": "the harrowing scene as Barry navigates the treacherous waters of the Whole Foods parking lot",
                                "alternative_words": {
                                    "2": "Barry"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 6
                                },
                                "total_score": 21,
                                "similarity_score": 3,
                                "adjusted_score": 18
                            }
                        ]
                    }
                },
                {
                    "analogy_index": 2,
                    "original_analogy": "the Sisyphean task of maintaining relevance in a world where being {3} to the {4} carries about as much weight as a participation trophy in a toddler's tee-ball league",
                    "alternative_sets": [
                        {
                            "analogy": "the Sisyphean task of maintaining relevance in a world where being second to last to the Potato Chip Dynasty carries about as much weight as a participation trophy in a toddler's tee-ball league",
                            "alternative_words": {
                                "4": "Potato Chip Dynasty",
                                "3": "second to last"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 7,
                                "bite_score": 8
                            },
                            "total_score": 24,
                            "similarity_score": 4,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "the Sisyphean task of maintaining relevance in a world where being middle of the pack to the Chocolate Kingdom carries about as much weight as a participation trophy in a toddler's tee-ball league",
                            "alternative_words": {
                                "4": "Chocolate Kingdom",
                                "3": "middle of the pack"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 4,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "the Sisyphean task of maintaining relevance in a world where being third in queue to the Pizza Empire carries about as much weight as a participation trophy in a toddler's tee-ball league",
                            "alternative_words": {
                                "4": "Pizza Empire",
                                "3": "third in queue"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 4,
                            "adjusted_score": 17
                        },
                        {
                            "analogy": "the Sisyphean task of maintaining relevance in a world where being next in rotation to the Coffee Realm carries about as much weight as a participation trophy in a toddler's tee-ball league",
                            "alternative_words": {
                                "4": "Coffee Realm",
                                "3": "next in rotation"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 4,
                            "adjusted_score": 17
                        },
                        {
                            "analogy": "the Sisyphean task of maintaining relevance in a world where being last but one to the Soda Pop Dominion carries about as much weight as a participation trophy in a toddler's tee-ball league",
                            "alternative_words": {
                                "4": "Soda Pop Dominion",
                                "3": "last but one"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 4,
                            "adjusted_score": 17
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "the Sisyphean task of maintaining relevance in a world where being second to last to the Potato Chip Dynasty carries about as much weight as a participation trophy in a toddler's tee-ball league",
                                "alternative_words": {
                                    "4": "Potato Chip Dynasty",
                                    "3": "second to last"
                                },
                                "scores": {
                                    "originality_score": 9,
                                    "humor_score": 7,
                                    "bite_score": 8
                                },
                                "total_score": 24,
                                "similarity_score": 4,
                                "adjusted_score": 20
                            },
                            {
                                "analogy": "the Sisyphean task of maintaining relevance in a world where being middle of the pack to the Chocolate Kingdom carries about as much weight as a participation trophy in a toddler's tee-ball league",
                                "alternative_words": {
                                    "4": "Chocolate Kingdom",
                                    "3": "middle of the pack"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 9
                                },
                                "total_score": 24,
                                "similarity_score": 4,
                                "adjusted_score": 20
                            }
                        ]
                    }
                }
            ],
            "final_alternative_keywords": [
                [
                    "The Hipster Duke of Trendytown",
                    "The Burger King of Fast-Food Kingdom"
                ],
                [
                    "Larry",
                    "Barry"
                ],
                [
                    "Chocolate Kingdom",
                    "Potato Chip Dynasty"
                ],
                [
                    "middle of the pack",
                    "second to last"
                ]
            ],
            "six_word_story": "Prince Harry reflects on life changes."
        }
    ]
}