{
    "results": [
        {
            "style_code": "Style 1",
            "satirical_column": "In a twist that would make even Shakespeare's dysfunctional families blush, the Murdoch clan has descended upon Reno, Nevada, to play a high-stakes game of \"Who Wants to Be a Media Mogul?\" It's like Succession meets Fear Factor, with a dash of The Hunger Games thrown in for good measure.\n\nPicture this: 93-year-old Rupert Murdoch, looking like a sentient raisin in an Armani suit, rolling into town with his brood, ready to carve up his empire like a Thanksgiving turkey with dementia. The family arrives in a seven-car convoy of black SUVs, because nothing says \"we're just regular folks\" quite like enough vehicles to equip a small militia.\n\nReno, the \"Biggest Little City in the World,\" finds itself hosting the \"Biggest Little Shit Show in the World.\" It's a place where, as they say, \"You go to Vegas to get married, and Reno to get divorced.\" In this case, it's where you go to divorce yourself from reality and basic human decency.\n\nThe courthouse, usually reserved for quickie divorces and drunken misdemeanors, now plays host to a family feud that could reshape the global media landscape. It's like watching the Kardashians fight over who gets to keep the world's largest collection of conservative talking points and climate change denial pamphlets.\n\nYoung Lachlan, daddy's favorite and the family's answer to a Ken doll with a MBA, is set to inherit the keys to the kingdom. Meanwhile, his siblings James, Elisabeth, and Prudence are left to fight over the scraps like seagulls at a landfill. It's heartwarming, really, to see a family so committed to perpetuating misinformation and political division that they're willing to tear themselves apart over it.\n\nThe irony of Fox News' future being decided in a sealed courtroom is not lost on us. It's fitting that a network built on obfuscation and selective reporting should have its fate determined in complete secrecy. Perhaps they'll introduce a new segment: \"Things We're Not Telling You Because We Legally Can't.\"\n\nAs the trial unfolds behind closed doors, one can't help but imagine the scene inside. Is Rupert sitting on a throne made of shredded New York Times newspapers? Are the siblings engaged in a no-holds-barred cage match, with the winner getting control of Tucker Carlson's bow tie collection? The mind boggles at the possibilities.\n\nMeanwhile, the good people of Reno go about their business, blissfully unaware that the future of global media is being decided over their heads. It's like finding out that the fate of democracy is being determined by a heated game of bingo at your local community center.\n\nIn the end, whatever the outcome, we can be sure of one thing: the Murdoch empire will continue to be a beacon of journalistic integrity, much like how a dumpster fire is a beacon of warmth and light. As for the family Christmas dinner? Let's just say it might make the Red Wedding look like a friendly game of Monopoly.\n\nSo here's to you, Murdoch family. May your court battles be as fair and balanced as your news coverage, and may your family therapy bills be as massive as your offshore bank accounts. Reno may be where you go to get divorced, but for the rest of us, it's where we watch the slow-motion car crash of late-stage capitalism and nepotism collide in a spectacular fashion. Cheers!",
            "headline": "Murdoch's Reno Roulette: When Daddy Issues Meet Media Monopoly",
            "explanation": "The analogies in this satirical column are effective because they vividly illustrate the chaotic and absurd nature of the Murdoch family's power struggles while also providing humorous cultural references. They engage the reader's imagination, drawing parallels between the Murdoch family's dynamics and well-known cultural phenomena, which enhances the entertainment value. The analogies create a comedic tone that underscores the ridiculousness of the situation, making the commentary on media monopoly and familial dysfunction both accessible and engaging.",
            "analogy_1": "It's like Succession meets Fear Factor, with a dash of The Hunger Games thrown in for good measure.",
            "analogy_2": "It's like watching the Kardashians fight over who gets to keep the world's largest collection of conservative talking points and climate change denial pamphlets.",
            "analogy_3": "It's like finding out that the fate of democracy is being determined by a heated game of bingo at your local community center.",
            "scored_analogies": [
                {
                    "id": 1,
                    "style_code": "Style 1",
                    "analogy": "It's like Succession meets Fear Factor, with a dash of The Hunger Games thrown in for good measure.",
                    "humor_score": 8,
                    "originality_score": 7,
                    "bite_score": 8,
                    "total_score": 23
                },
                {
                    "id": 2,
                    "style_code": "Style 1",
                    "analogy": "It's like watching the Kardashians fight over who gets to keep the world's largest collection of conservative talking points and climate change denial pamphlets.",
                    "humor_score": 9,
                    "originality_score": 8,
                    "bite_score": 8,
                    "total_score": 25
                },
                {
                    "id": 3,
                    "style_code": "Style 1",
                    "analogy": "It's like finding out that the fate of democracy is being determined by a heated game of bingo at your local community center.",
                    "humor_score": 7,
                    "originality_score": 6,
                    "bite_score": 7,
                    "total_score": 20
                }
            ],
            "total_set_score": 68
        },
        {
            "style_code": "Style 2",
            "satirical_column": "In the neon-drenched fever dream that is Reno, Nevada - where Elvis impersonators outnumber actual residents and the air tastes of stale cigarettes and broken dreams - a family drama of truly cosmic proportions is unfolding. The Murdoch clan, those puppeteers of public opinion, have descended upon \"The Biggest Little City in the World\" like a swarm of well-tailored locusts, ready to feast upon the carcass of their own media empire.\n\nPicture, if you will, Rupert Murdoch - part Blofeld, part Palpatine, all mogul - wheeled into the Washoe County Courthouse atop a gilded throne fashioned from the melted-down Emmys of cancelled Fox News hosts. His children, each a perfect caricature of entitled nepotism, trail behind like ducklings imprinted on a particularly irascible and influential mallard.\n\nThe courthouse itself, usually a bastion of banal bureaucracy, has been transformed into a labyrinthine fun house of legal chicanery. Rooms shift and morph, contracts appear and disappear like quantum particles, and time itself seems to bend to the will of the most powerful family in media. One almost expects to see the Cheshire Cat grinning from the bench, dispensing riddles about stock options and voting rights.\n\nAt the heart of this fantastical farce lies the £14.9bn trust - a number so large it can only be conceptualized in terms of how many times it could circle the globe in $100 bills or how many small countries it could buy outright. This golden ticket to media domination is the prize over which the Murdoch offspring grapple like particularly well-dressed chimps fighting over the last banana.\n\nLachlan, the chosen one, struts through the courthouse corridors like a peacock that's discovered hair gel, his very presence seeming to scream, \"I'm not just the hair apparent, I'm the heir apparent!\" Meanwhile, James, Elisabeth, and Prudence huddle in corners, plotting like characters from a Shakespeare play rewritten by Aaron Sorkin and directed by Wes Anderson.\n\nAs the family feud rages behind closed doors, the good people of Reno remain blissfully unaware, more concerned with hitting the jackpot on the penny slots than the future of global media. In the tea shop around the corner, patrons sip their Earl Grey, oblivious to the fact that just yards away, the fate of what they'll be watching on their screens for the next decade is being decided by a family with all the warmth and functionality of the Borgias.\n\nOne can't help but wonder what the ghost of Hunter S. Thompson would make of this spectacle. Perhaps he'd see it as the logical endpoint of the American Dream - a family of media moguls, hopped up on power and greed, duking it out in a city built on false hopes and broken kneecaps. It's fear and loathing in Las Vegas, but with better tailoring and more potential to shape global discourse.\n\nAs the black SUVs prowl the streets like mechanical panthers, one thing becomes clear: in the grand casino of life, the House of Murdoch always wins. The only question is which particular Murdoch will be holding the chips when the cosmic roulette wheel finally stops spinning.\n\nSo here's to you, Reno, you beautiful, bewildered hostess to the most surreal family reunion since the Addams Family vacation. May your slot machines keep spinning, your divorces remain quick and painless, and may you forever remain blissfully unaware of the Lovecraftian horror of media manipulation being birthed in your courthouse. After all, what happens in Reno... shapes the world.",
            "headline": "Reno's Cosmic Casino: Murdochs Gamble for Galactic Media Dominion in Quantum Court",
            "explanation": "The analogies in this column effectively highlight the absurdity and theatricality of the Murdoch family's legal battle, using vivid imagery and comparisons that enhance the satirical tone. They illustrate the chaotic nature of media power dynamics and familial rivalry, while also drawing on cultural references that resonate with readers. The analogies create a surreal and entertaining picture of the situation, making complex themes accessible and engaging.",
            "analogy_1": "the Murdoch clan... have descended upon 'The Biggest Little City in the World' like a swarm of well-tailored locusts",
            "analogy_2": "the courthouse itself... has been transformed into a labyrinthine fun house of legal chicanery",
            "analogy_3": "grapple like particularly well-dressed chimps fighting over the last banana",
            "scored_analogies": [
                {
                    "id": 4,
                    "style_code": "Style 2",
                    "analogy": "the Murdoch clan... have descended upon 'The Biggest Little City in the World' like a swarm of well-tailored locusts",
                    "humor_score": 8,
                    "originality_score": 9,
                    "bite_score": 8,
                    "total_score": 25
                },
                {
                    "id": 5,
                    "style_code": "Style 2",
                    "analogy": "the courthouse itself... has been transformed into a labyrinthine fun house of legal chicanery",
                    "humor_score": 7,
                    "originality_score": 8,
                    "bite_score": 8,
                    "total_score": 23
                },
                {
                    "id": 6,
                    "style_code": "Style 2",
                    "analogy": "grapple like particularly well-dressed chimps fighting over the last banana",
                    "humor_score": 9,
                    "originality_score": 8,
                    "bite_score": 9,
                    "total_score": 26
                }
            ],
            "total_set_score": 74,
            "labelled_analogies": [
                "the {{Murdoch}} clan... have descended upon '{{The Biggest Little City in the World}}' like a swarm of well-tailored locusts",
                "the {{courthouse}} itself... has been transformed into a labyrinthine fun house of legal chicanery",
                "grapple like particularly well-dressed chimps fighting over the last {{banana}}"
            ],
            "processed_analogies": [
                "the {1} clan... have descended upon '{2}' like a swarm of well-tailored locusts",
                "the {3} itself... has been transformed into a labyrinthine fun house of legal chicanery",
                "grapple like particularly well-dressed chimps fighting over the last {4}"
            ],
            "giveaway_keywords": [
                {
                    "id": 1,
                    "answer": "Murdoch"
                },
                {
                    "id": 2,
                    "answer": "The Biggest Little City in the World"
                },
                {
                    "id": 3,
                    "answer": "courthouse"
                },
                {
                    "id": 4,
                    "answer": "banana"
                }
            ],
            "alternative_sets": [
                {
                    "analogy_index": 0,
                    "original_analogy": "the {1} clan... have descended upon '{2}' like a swarm of well-tailored locusts",
                    "alternative_sets": [
                        {
                            "analogy": "the Bigfoot clan... have descended upon 'The Most Average Metropolis' like a swarm of well-tailored locusts",
                            "alternative_words": {
                                "2": "The Most Average Metropolis",
                                "1": "Bigfoot"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "the Sherlock Holmes clan... have descended upon 'The Greatest Hamlet' like a swarm of well-tailored locusts",
                            "alternative_words": {
                                "2": "The Greatest Hamlet",
                                "1": "Sherlock Holmes"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "the The Loch Ness Monster clan... have descended upon 'The Smallest Large Village' like a swarm of well-tailored locusts",
                            "alternative_words": {
                                "2": "The Smallest Large Village",
                                "1": "The Loch Ness Monster"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "the The Tooth Fairy clan... have descended upon 'The Ultimate Tiny Town' like a swarm of well-tailored locusts",
                            "alternative_words": {
                                "2": "The Ultimate Tiny Town",
                                "1": "The Tooth Fairy"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        },
                        {
                            "analogy": "the Santa Claus clan... have descended upon 'The Supreme Miniature City' like a swarm of well-tailored locusts",
                            "alternative_words": {
                                "2": "The Supreme Miniature City",
                                "1": "Santa Claus"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 1,
                            "adjusted_score": 20
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "the Bigfoot clan... have descended upon 'The Most Average Metropolis' like a swarm of well-tailored locusts",
                                "alternative_words": {
                                    "2": "The Most Average Metropolis",
                                    "1": "Bigfoot"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 6
                                },
                                "total_score": 21,
                                "similarity_score": 1,
                                "adjusted_score": 20
                            },
                            {
                                "analogy": "the Sherlock Holmes clan... have descended upon 'The Greatest Hamlet' like a swarm of well-tailored locusts",
                                "alternative_words": {
                                    "2": "The Greatest Hamlet",
                                    "1": "Sherlock Holmes"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 6
                                },
                                "total_score": 21,
                                "similarity_score": 1,
                                "adjusted_score": 20
                            }
                        ]
                    }
                },
                {
                    "analogy_index": 1,
                    "original_analogy": "the {3} itself... has been transformed into a labyrinthine fun house of legal chicanery",
                    "alternative_sets": [
                        {
                            "analogy": "the zoo itself... has been transformed into a labyrinthine fun house of legal chicanery",
                            "alternative_words": {
                                "3": "zoo"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 3,
                            "adjusted_score": 21
                        },
                        {
                            "analogy": "the haunted house itself... has been transformed into a labyrinthine fun house of legal chicanery",
                            "alternative_words": {
                                "3": "haunted house"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 3,
                            "adjusted_score": 21
                        },
                        {
                            "analogy": "the water park itself... has been transformed into a labyrinthine fun house of legal chicanery",
                            "alternative_words": {
                                "3": "water park"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 9
                            },
                            "total_score": 24,
                            "similarity_score": 3,
                            "adjusted_score": 21
                        },
                        {
                            "analogy": "the arcade itself... has been transformed into a labyrinthine fun house of legal chicanery",
                            "alternative_words": {
                                "3": "arcade"
                            },
                            "scores": {
                                "originality_score": 7,
                                "humor_score": 6,
                                "bite_score": 8
                            },
                            "total_score": 21,
                            "similarity_score": 3,
                            "adjusted_score": 18
                        },
                        {
                            "analogy": "the karaoke bar itself... has been transformed into a labyrinthine fun house of legal chicanery",
                            "alternative_words": {
                                "3": "karaoke bar"
                            },
                            "scores": {
                                "originality_score": 7,
                                "humor_score": 6,
                                "bite_score": 8
                            },
                            "total_score": 21,
                            "similarity_score": 3,
                            "adjusted_score": 18
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "the zoo itself... has been transformed into a labyrinthine fun house of legal chicanery",
                                "alternative_words": {
                                    "3": "zoo"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 9
                                },
                                "total_score": 24,
                                "similarity_score": 3,
                                "adjusted_score": 21
                            },
                            {
                                "analogy": "the haunted house itself... has been transformed into a labyrinthine fun house of legal chicanery",
                                "alternative_words": {
                                    "3": "haunted house"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 9
                                },
                                "total_score": 24,
                                "similarity_score": 3,
                                "adjusted_score": 21
                            }
                        ]
                    }
                },
                {
                    "analogy_index": 2,
                    "original_analogy": "grapple like particularly well-dressed chimps fighting over the last {4}",
                    "alternative_sets": [
                        {
                            "analogy": "grapple like particularly well-dressed chimps fighting over the last taco",
                            "alternative_words": {
                                "4": "taco"
                            },
                            "scores": {
                                "originality_score": 9,
                                "humor_score": 8,
                                "bite_score": 6
                            },
                            "total_score": 23,
                            "similarity_score": 2,
                            "adjusted_score": 21
                        },
                        {
                            "analogy": "grapple like particularly well-dressed chimps fighting over the last hamster",
                            "alternative_words": {
                                "4": "hamster"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 2,
                            "adjusted_score": 19
                        },
                        {
                            "analogy": "grapple like particularly well-dressed chimps fighting over the last kazoo",
                            "alternative_words": {
                                "4": "kazoo"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 6
                            },
                            "total_score": 21,
                            "similarity_score": 2,
                            "adjusted_score": 19
                        },
                        {
                            "analogy": "grapple like particularly well-dressed chimps fighting over the last rubber duck",
                            "alternative_words": {
                                "4": "rubber duck"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 5
                            },
                            "total_score": 20,
                            "similarity_score": 2,
                            "adjusted_score": 18
                        },
                        {
                            "analogy": "grapple like particularly well-dressed chimps fighting over the last yo-yo",
                            "alternative_words": {
                                "4": "yo-yo"
                            },
                            "scores": {
                                "originality_score": 8,
                                "humor_score": 7,
                                "bite_score": 5
                            },
                            "total_score": 20,
                            "similarity_score": 2,
                            "adjusted_score": 18
                        }
                    ],
                    "selected_alternatives": {
                        "top_2_sets": [
                            {
                                "analogy": "grapple like particularly well-dressed chimps fighting over the last taco",
                                "alternative_words": {
                                    "4": "taco"
                                },
                                "scores": {
                                    "originality_score": 9,
                                    "humor_score": 8,
                                    "bite_score": 6
                                },
                                "total_score": 23,
                                "similarity_score": 2,
                                "adjusted_score": 21
                            },
                            {
                                "analogy": "grapple like particularly well-dressed chimps fighting over the last hamster",
                                "alternative_words": {
                                    "4": "hamster"
                                },
                                "scores": {
                                    "originality_score": 8,
                                    "humor_score": 7,
                                    "bite_score": 6
                                },
                                "total_score": 21,
                                "similarity_score": 2,
                                "adjusted_score": 19
                            }
                        ]
                    }
                }
            ],
            "final_alternative_keywords": [
                [
                    "The Most Average Metropolis",
                    "The Greatest Hamlet"
                ],
                [
                    "Bigfoot",
                    "Sherlock Holmes"
                ],
                [
                    "haunted house",
                    "zoo"
                ],
                [
                    "hamster",
                    "taco"
                ]
            ],
            "six_word_story": "Murdoch family secretly fights over empire."
        },
        {
            "style_code": "Style 3",
            "satirical_column": "In the neon-lit crucible of Reno, Nevada—a city more accustomed to quickie divorces and all-you-can-eat buffets than Machiavellian power plays—the Murdoch clan has descended like a flock of well-coiffed vultures to feast on the carcass of their patriarch's media empire. It's a spectacle that would make even the most jaded Roman emperor blush, or at least reach for his remote control.\n\nPicture, if you will, a cavalcade of black SUVs snaking through the streets of \"The Biggest Little City in the World,\" each vehicle packed tighter than a Fox News greenroom during a Trump rally. Inside, the Murdoch progeny sharpen their metaphorical knives, no doubt debating whether to carve up daddy's empire like a Thanksgiving turkey or play a rousing game of \"Who Wants to Be a Billionaire?\"\n\nAs I sipped my artisanal kombucha outside the courthouse (because nothing says \"I'm here for the drama\" quite like fermented tea), I couldn't help but marvel at the cosmic irony. Here was a family that had built its fortune on airing the world's dirty laundry, now desperately trying to keep its own soiled underthings under wraps. If only they'd thought to create a reality show about their squabbles—\"Keeping Up with the Murdochs\" has such a delicious ring to it, doesn't it?\n\nBut alas, in true Nevada fashion, what happens in Reno stays in Reno. The court proceedings are sealed tighter than Rupert's grip on conservative media, leaving us plebeians to speculate wildly about the familial fireworks erupting behind closed doors. Are they arm-wrestling for control of Fox News? Playing a high-stakes game of Monopoly with real media properties? Or perhaps engaging in a no-holds-barred round of \"Survivor: Newsroom Edition\"?\n\nOne can only imagine the scene inside the courthouse. Lachlan, the golden boy, strutting about like a peacock in a power suit, while James sulks in the corner, muttering something about \"climate change\" and \"journalistic integrity.\" Elisabeth, ever the dark horse, probably sits in stoic silence, plotting her own media takeover with the patience of a spider. And let's not forget Prudence, the oft-overlooked eldest, who might just be biding her time to pull a Michael Corleone and seize control when everyone least expects it.\n\nMeanwhile, outside in the real world (a concept seemingly alien to the Murdochs), life in Reno goes on. Locals sip their lattes, blissfully unaware that the future of global media is being decided just yards away. It's a bit like finding out that the fate of the universe is being determined by a heated game of bingo at your local community center.\n\nAs this tragicomic opera unfolds, one can't help but wonder: what would William Randolph Hearst think? Or perhaps more aptly, what would Charles Foster Kane say? \"Rosebud\" indeed—though in this case, it's less likely to be a childhood sled and more likely to be a well-worn copy of \"The Art of the Deal.\"\n\nIn the end, as the dust settles on this desert drama, we're left with more questions than answers. Will Lachlan emerge victorious, ready to lead Fox News into a brave new world of even more alternative facts? Will James stage a coup and turn the network into a 24/7 climate change telethon? Or will Rupert, in a twist worthy of a Shakespearean comedy, decide to live forever and keep running the show from his cryogenic chamber?\n\nOne thing's for certain: whatever the outcome, it'll be news to someone. And isn't that what the Murdochs have always been about? Creating news, shaping news, and now, in a delicious twist of fate, becoming the news themselves. \n\nAs I pack up my notepad and head for the airport, I can't shake the feeling that I've just witnessed something profound—a changing of the guard, a shift in the media landscape, or perhaps just a really expensive family therapy session. But hey, that's showbiz, baby. And in Reno, the show must go on... even if it's hidden behind a wall of black SUVs and sealed court documents.",
            "headline": "The Biggest Little Bloodbath in the World: Murdochs Turn Reno into a Tragicomic Soap Opera",
            "explanation": "The analogies in this satirical column effectively blend humor and social commentary, illustrating the absurdity of the Murdoch family's power struggles and their impact on media. The writer uses vivid imagery and relatable comparisons, allowing readers to grasp complex dynamics through familiar scenarios. The analogies are both entertaining and thought-provoking, enhancing the satirical nature of the piece.",
            "analogy_1": "the Murdoch clan has descended like a flock of well-coiffed vultures to feast on the carcass of their patriarch's media empire",
            "analogy_2": "each vehicle packed tighter than a Fox News greenroom during a Trump rally",
            "analogy_3": "It's a bit like finding out that the fate of the universe is being determined by a heated game of bingo at your local community center",
            "scored_analogies": [
                {
                    "id": 7,
                    "style_code": "Style 3",
                    "analogy": "the Murdoch clan has descended like a flock of well-coiffed vultures to feast on the carcass of their patriarch's media empire",
                    "humor_score": 9,
                    "originality_score": 9,
                    "bite_score": 9,
                    "total_score": 27
                },
                {
                    "id": 8,
                    "style_code": "Style 3",
                    "analogy": "each vehicle packed tighter than a Fox News greenroom during a Trump rally",
                    "humor_score": 8,
                    "originality_score": 7,
                    "bite_score": 8,
                    "total_score": 23
                },
                {
                    "id": 9,
                    "style_code": "Style 3",
                    "analogy": "It's a bit like finding out that the fate of the universe is being determined by a heated game of bingo at your local community center",
                    "humor_score": 6,
                    "originality_score": 5,
                    "bite_score": 6,
                    "total_score": 17
                }
            ],
            "total_set_score": 67
        }
    ]
}